MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
extern volatile REFO2CON3bits_t REFO2CON3bits __at(0xEDB);
// bitfield macros
#define _REFO2CON3_RODIV_POSN                               0x0
#define _REFO2CON3_RODIV_POSITION                           0x0
#define _REFO2CON3_RODIV_SIZE                               0x7
#define _REFO2CON3_RODIV_LENGTH                             0x7
#define _REFO2CON3_RODIV_MASK                               0x7F
#define _REFO2CON3_RODIV8_POSN                              0x0
#define _REFO2CON3_RODIV8_POSITION                          0x0
#define _REFO2CON3_RODIV8_SIZE                              0x1
#define _REFO2CON3_RODIV8_LENGTH                            0x1
#define _REFO2CON3_RODIV8_MASK                              0x1
#define _REFO2CON3_RODIV9_POSN                              0x1
#define _REFO2CON3_RODIV9_POSITION                          0x1
#define _REFO2CON3_RODIV9_SIZE                              0x1
#define _REFO2CON3_RODIV9_LENGTH                            0x1
#define _REFO2CON3_RODIV9_MASK                              0x2
#define _REFO2CON3_RODIV10_POSN                             0x2
#define _REFO2CON3_RODIV10_POSITION                         0x2
#define _REFO2CON3_RODIV10_SIZE                             0x1
#define _REFO2CON3_RODIV10_LENGTH                           0x1
#define _REFO2CON3_RODIV10_MASK                             0x4
#define _REFO2CON3_RODIV11_POSN                             0x3
#define _REFO2CON3_RODIV11_POSITION                         0x3
#define _REFO2CON3_RODIV11_SIZE                             0x1
#define _REFO2CON3_RODIV11_LENGTH                           0x1
#define _REFO2CON3_RODIV11_MASK                             0x8
#define _REFO2CON3_RODIV12_POSN                             0x4
#define _REFO2CON3_RODIV12_POSITION                         0x4
#define _REFO2CON3_RODIV12_SIZE                             0x1
#define _REFO2CON3_RODIV12_LENGTH                           0x1
#define _REFO2CON3_RODIV12_MASK                             0x10
#define _REFO2CON3_RODIV13_POSN                             0x5
#define _REFO2CON3_RODIV13_POSITION                         0x5
#define _REFO2CON3_RODIV13_SIZE                             0x1
#define _REFO2CON3_RODIV13_LENGTH                           0x1
#define _REFO2CON3_RODIV13_MASK                             0x20
#define _REFO2CON3_RODIV14_POSN                             0x6
#define _REFO2CON3_RODIV14_POSITION                         0x6
#define _REFO2CON3_RODIV14_SIZE                             0x1
#define _REFO2CON3_RODIV14_LENGTH                           0x1
#define _REFO2CON3_RODIV14_MASK                             0x40

// Register: REFO2CON2
#define REFO2CON2 REFO2CON2
extern volatile unsigned char           REFO2CON2           __at(0xEDC);
#ifndef _LIB_BUILD
asm("REFO2CON2 equ 0EDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RODIV                  :8;
    };
    struct {
        unsigned RODIV0                 :1;
        unsigned RODIV1                 :1;
        unsigned RODIV2                 :1;
        unsigned RODIV3                 :1;
        unsigned RODIV4                 :1;
        unsigned RODIV5                 :1;
        unsigned RODIV6                 :1;
        unsigned RODIV7                 :1;
    };
} REFO2CON2bits_t;
extern volatile REFO2CON2bits_t REFO2CON2bits __at(0xEDC);
// bitfield macros
#define _REFO2CON2_RODIV_POSN                               0x0
#define _REFO2CON2_RODIV_POSITION                           0x0
#define _REFO2CON2_RODIV_SIZE                               0x8
#define _REFO2CON2_RODIV_LENGTH                             0x8
#define _REFO2CON2_RODIV_MASK                               0xFF
#define _REFO2CON2_RODIV0_POSN                              0x0
#define _REFO2CON2_RODIV0_POSITION                          0x0
#define _REFO2CON2_RODIV0_SIZE                              0x1
#define _REFO2CON2_RODIV0_LENGTH                            0x1
#define _REFO2CON2_RODIV0_MASK                              0x1
#define _REFO2CON2_RODIV1_POSN                              0x1
#define _REFO2CON2_RODIV1_POSITION                          0x1
#define _REFO2CON2_RODIV1_SIZE                              0x1
#define _REFO2CON2_RODIV1_LENGTH                            0x1
#define _REFO2CON2_RODIV1_MASK                              0x2
#define _REFO2CON2_RODIV2_POSN                              0x2
#define _REFO2CON2_RODIV2_POSITION                          0x2
#define _REFO2CON2_RODIV2_SIZE                              0x1
#define _REFO2CON2_RODIV2_LENGTH                            0x1
#define _REFO2CON2_RODIV2_MASK                              0x4
#define _REFO2CON2_RODIV3_POSN                              0x3
#define _REFO2CON2_RODIV3_POSITION                          0x3
#define _REFO2CON2_RODIV3_SIZE                              0x1
#define _REFO2CON2_RODIV3_LENGTH                            0x1
#define _REFO2CON2_RODIV3_MASK                              0x8
#define _REFO2CON2_RODIV4_POSN                              0x4
#define _REFO2CON2_RODIV4_POSITION                          0x4
#define _REFO2CON2_RODIV4_SIZE                              0x1
#define _REFO2CON2_RODIV4_LENGTH                            0x1
#define _REFO2CON2_RODIV4_MASK                              0x10
#define _REFO2CON2_RODIV5_POSN                              0x5
#define _REFO2CON2_RODIV5_POSITION                          0x5
#define _REFO2CON2_RODIV5_SIZE                              0x1
#define _REFO2CON2_RODIV5_LENGTH                            0x1
#define _REFO2CON2_RODIV5_MASK                              0x20
#define _REFO2CON2_RODIV6_POSN                              0x6
#define _REFO2CON2_RODIV6_POSITION                          0x6
#define _REFO2CON2_RODIV6_SIZE                              0x1
#define _REFO2CON2_RODIV6_LENGTH                            0x1
#define _REFO2CON2_RODIV6_MASK                              0x40
#define _REFO2CON2_RODIV7_POSN                              0x7
#define _REFO2CON2_RODIV7_POSITION                          0x7
#define _REFO2CON2_RODIV7_SIZE                              0x1
#define _REFO2CON2_RODIV7_LENGTH                            0x1
#define _REFO2CON2_RODIV7_MASK                              0x80

// Register: REFO2CON1
#define REFO2CON1 REFO2CON1
extern volatile unsigned char           REFO2CON1           __at(0xEDD);
#ifndef _LIB_BUILD
asm("REFO2CON1 equ 0EDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ROSEL                  :4;
    };
    struct {
        unsigned ROSEL0                 :1;
        unsigned ROSEL1                 :1;
        unsigned ROSEL2                 :1;
        unsigned ROSEL3                 :1;
    };
} REFO2CON1bits_t;
extern volatile REFO2CON1bits_t REFO2CON1bits __at(0xEDD);
// bitfield macros
#define _REFO2CON1_ROSEL_POSN                               0x0
#define _REFO2CON1_ROSEL_POSITION                           0x0
#define _REFO2CON1_ROSEL_SIZE                               0x4
#define _REFO2CON1_ROSEL_LENGTH                             0x4
#define _REFO2CON1_ROSEL_MASK                               0xF
#define _REFO2CON1_ROSEL0_POSN                              0x0
#define _REFO2CON1_ROSEL0_POSITION                          0x0
#define _REFO2CON1_ROSEL0_SIZE                              0x1
#define _REFO2CON1_ROSEL0_LENGTH                            0x1
#define _REFO2CON1_ROSEL0_MASK                              0x1
#define _REFO2CON1_ROSEL1_POSN                              0x1
#define _REFO2CON1_ROSEL1_POSITION                          0x1
#define _REFO2CON1_ROSEL1_SIZE                              0x1
#define _REFO2CON1_ROSEL1_LENGTH                            0x1
#define _REFO2CON1_ROSEL1_MASK                              0x2
#define _REFO2CON1_ROSEL2_POSN                              0x2
#define _REFO2CON1_ROSEL2_POSITION                          0x2
#define _REFO2CON1_ROSEL2_SIZE                              0x1
#define _REFO2CON1_ROSEL2_LENGTH                            0x1
#define _REFO2CON1_ROSEL2_MASK                              0x4
#define _REFO2CON1_ROSEL3_POSN                              0x3
#define _REFO2CON1_ROSEL3_POSITION                          0x3
#define _REFO2CON1_ROSEL3_SIZE                              0x1
#define _REFO2CON1_ROSEL3_LENGTH                            0x1
#define _REFO2CON1_ROSEL3_MASK                              0x8

// Register: REFO2CON
#define REFO2CON REFO2CON
extern volatile unsigned char           REFO2CON            __at(0xEDE);
#ifndef _LIB_BUILD
asm("REFO2CON equ 0EDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACTIVE                 :1;
        unsigned DIVSWEN                :1;
        unsigned                        :1;
        unsigned ROSSLP                 :1;
        unsigned ROOE                   :1;
        unsigned ROSIDL                 :1;
        unsigned                        :1;
        unsigned ROON                   :1;
    };
} REFO2CONbits_t;
extern volatile REFO2CONbits_t REFO2CONbits __at(0xEDE);
// bitfield macros
#define _REFO2CON_ACTIVE_POSN                               0x0
#define _REFO2CON_ACTIVE_POSITION                           0x0
#define _REFO2CON_ACTIVE_SIZE                               0x1
#define _REFO2CON_ACTIVE_LENGTH                             0x1
#define _REFO2CON_ACTIVE_MASK                               0x1
#define _REFO2CON_DIVSWEN_POSN                              0x1
#define _REFO2CON_DIVSWEN_POSITION                          0x1
#define _REFO2CON_DIVSWEN_SIZE                              0x1
#define _REFO2CON_DIVSWEN_LENGTH                            0x1
#define _REFO2CON_DIVSWEN_MASK                              0x2
#define _REFO2CON_ROSSLP_POSN                               0x3
#define _REFO2CON_ROSSLP_POSITION                           0x3
#define _REFO2CON_ROSSLP_SIZE                               0x1
#define _REFO2CON_ROSSLP_LENGTH                             0x1
#define _REFO2CON_ROSSLP_MASK                               0x8
#define _REFO2CON_ROOE_POSN                                 0x4
#define _REFO2CON_ROOE_POSITION                             0x4
#define _REFO2CON_ROOE_SIZE                                 0x1
#define _REFO2CON_ROOE_LENGTH                               0x1
#define _REFO2CON_ROOE_MASK                                 0x10
#define _REFO2CON_ROSIDL_POSN                               0x5
#define _REFO2CON_ROSIDL_POSITION                           0x5
#define _REFO2CON_ROSIDL_SIZE                               0x1
#define _REFO2CON_ROSIDL_LENGTH                             0x1
#define _REFO2CON_ROSIDL_MASK                               0x20
#define _REFO2CON_ROON_POSN                                 0x7
#define _REFO2CON_ROON_POSITION                             0x7
#define _REFO2CON_ROON_SIZE                                 0x1
#define _REFO2CON_ROON_LENGTH                               0x1
#define _REFO2CON_ROON_MASK                                 0x80

// Register: REFO1CON3
#define REFO1CON3 REFO1CON3
extern volatile unsigned char           REFO1CON3           __at(0xEDF);
#ifndef _LIB_BUILD
asm("REFO1CON3 equ 0EDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RODIV                  :7;
    };
    struct {
        unsigned RODIV8                 :1;
        unsigned RODIV9                 :1;
        unsigned RODIV10                :1;
        unsigned RODIV11                :1;
        unsigned RODIV12                :1;
        unsigned RODIV13                :1;
        unsigned RODIV14                :1;
    };
} REFO1CON3bits_t;
extern volatile REFO1CON3bits_t REFO1CON3bits __at(0xEDF);
// bitfield macros
#define _REFO1CON3_RODIV_POSN                               0x0
#define _REFO1CON3_RODIV_POSITION                           0x0
#define _REFO1CON3_RODIV_SIZE                               0x7
#define _REFO1CON3_RODIV_LENGTH                             0x7
#define _REFO1CON3_RODIV_MASK                               0x7F
#define _REFO1CON3_RODIV8_POSN                              0x0
#define _REFO1CON3_RODIV8_POSITION                          0x0
#define _REFO1CON3_RODIV8_SIZE                              0x1
#define _REFO1CON3_RODIV8_LENGTH                            0x1
#define _REFO1CON3_RODIV8_MASK                              0x1
#define _REFO1CON3_RODIV9_POSN                              0x1
#define _REFO1CON3_RODIV9_POSITION                          0x1
#define _REFO1CON3_RODIV9_SIZE                              0x1
#define _REFO1CON3_RODIV9_LENGTH                            0x1
#define _REFO1CON3_RODIV9_MASK                              0x2
#define _REFO1CON3_RODIV10_POSN                             0x2
#define _REFO1CON3_RODIV10_POSITION                         0x2
#define _REFO1CON3_RODIV10_SIZE                             0x1
#define _REFO1CON3_RODIV10_LENGTH                           0x1
#define _REFO1CON3_RODIV10_MASK                             0x4
#define _REFO1CON3_RODIV11_POSN                             0x3
#define _REFO1CON3_RODIV11_POSITION                         0x3
#define _REFO1CON3_RODIV11_SIZE                             0x1
#define _REFO1CON3_RODIV11_LENGTH                           0x1
#define _REFO1CON3_RODIV11_MASK                             0x8
#define _REFO1CON3_RODIV12_POSN                             0x4
#define _REFO1CON3_RODIV12_POSITION                         0x4
#define _REFO1CON3_RODIV12_SIZE                             0x1
#define _REFO1CON3_RODIV12_LENGTH                           0x1
#define _REFO1CON3_RODIV12_MASK                             0x10
#define _REFO1CON3_RODIV13_POSN                             0x5
#define _REFO1CON3_RODIV13_POSITION                         0x5
#define _REFO1CON3_RODIV13_SIZE                             0x1
#define _REFO1CON3_RODIV13_LENGTH                           0x1
#define _REFO1CON3_RODIV13_MASK                             0x20
#define _REFO1CON3_RODIV14_POSN                             0x6
#define _REFO1CON3_RODIV14_POSITION                         0x6
#define _REFO1CON3_RODIV14_SIZE                             0x1
#define _REFO1CON3_RODIV14_LENGTH                           0x1
#define _REFO1CON3_RODIV14_MASK                             0x40

// Register: REFO1CON2
#define REFO1CON2 REFO1CON2
extern volatile unsigned char           REFO1CON2           __at(0xEE0);
#ifndef _LIB_BUILD
asm("REFO1CON2 equ 0EE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RODIV                  :8;
    };
    struct {
        unsigned RODIV0                 :1;
        unsigned RODIV1                 :1;
        unsigned RODIV2                 :1;
        unsigned RODIV3                 :1;
        unsigned RODIV4                 :1;
        unsigned RODIV5                 :1;
        unsigned RODIV6                 :1;
        unsigned RODIV7                 :1;
    };
} REFO1CON2bits_t;
extern volatile REFO1CON2bits_t REFO1CON2bits __at(0xEE0);
// bitfield macros
#define _REFO1CON2_RODIV_POSN                               0x0
#define _REFO1CON2_RODIV_POSITION                           0x0
#define _REFO1CON2_RODIV_SIZE                               0x8
#define _REFO1CON2_RODIV_LENGTH                             0x8
#define _REFO1CON2_RODIV_MASK                               0xFF
#define _REFO1CON2_RODIV0_POSN                              0x0
#define _REFO1CON2_RODIV0_POSITION                          0x0
#define _REFO1CON2_RODIV0_SIZE                              0x1
#define _REFO1CON2_RODIV0_LENGTH                            0x1
#define _REFO1CON2_RODIV0_MASK                              0x1
#define _REFO1CON2_RODIV1_POSN                              0x1
#define _REFO1CON2_RODIV1_POSITION                          0x1
#define _REFO1CON2_RODIV1_SIZE                              0x1
#define _REFO1CON2_RODIV1_LENGTH                            0x1
#define _REFO1CON2_RODIV1_MASK                              0x2
#define _REFO1CON2_RODIV2_POSN                              0x2
#define _REFO1CON2_RODIV2_POSITION                          0x2
#define _REFO1CON2_RODIV2_SIZE                              0x1
#define _REFO1CON2_RODIV2_LENGTH                            0x1
#define _REFO1CON2_RODIV2_MASK                              0x4
#define _REFO1CON2_RODIV3_POSN                              0x3
#define _REFO1CON2_RODIV3_POSITION                          0x3
#define _REFO1CON2_RODIV3_SIZE                              0x1
#define _REFO1CON2_RODIV3_LENGTH                            0x1
#define _REFO1CON2_RODIV3_MASK                              0x8
#define _REFO1CON2_RODIV4_POSN                              0x4
#define _REFO1CON2_RODIV4_POSITION                          0x4
#define _REFO1CON2_RODIV4_SIZE                              0x1
#define _REFO1CON2_RODIV4_LENGTH                            0x1
#define _REFO1CON2_RODIV4_MASK                              0x10
#define _REFO1CON2_RODIV5_POSN                              0x5
#define _REFO1CON2_RODIV5_POSITION                          0x5
#define _REFO1CON2_RODIV5_SIZE                              0x1
#define _REFO1CON2_RODIV5_LENGTH                            0x1
#define _REFO1CON2_RODIV5_MASK                              0x20
#define _REFO1CON2_RODIV6_POSN                              0x6
#define _REFO1CON2_RODIV6_POSITION                          0x6
#define _REFO1CON2_RODIV6_SIZE                              0x1
#define _REFO1CON2_RODIV6_LENGTH                            0x1
#define _REFO1CON2_RODIV6_MASK                              0x40
#define _REFO1CON2_RODIV7_POSN                              0x7
#define _REFO1CON2_RODIV7_POSITION                          0x7
#define _REFO1CON2_RODIV7_SIZE                              0x1
#define _REFO1CON2_RODIV7_LENGTH                            0x1
#define _REFO1CON2_RODIV7_MASK                              0x80

// Register: REFO1CON1
#define REFO1CON1 REFO1CON1
extern volatile unsigned char           REFO1CON1           __at(0xEE1);
#ifndef _LIB_BUILD
asm("REFO1CON1 equ 0EE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ROSEL                  :4;
    };
    struct {
        unsigned ROSEL0                 :1;
        unsigned ROSEL1                 :1;
        unsigned ROSEL2                 :1;
        unsigned ROSEL3                 :1;
    };
} REFO1CON1bits_t;
