MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
extern volatile REFO1CON1bits_t REFO1CON1bits __at(0xEE1);
// bitfield macros
#define _REFO1CON1_ROSEL_POSN                               0x0
#define _REFO1CON1_ROSEL_POSITION                           0x0
#define _REFO1CON1_ROSEL_SIZE                               0x4
#define _REFO1CON1_ROSEL_LENGTH                             0x4
#define _REFO1CON1_ROSEL_MASK                               0xF
#define _REFO1CON1_ROSEL0_POSN                              0x0
#define _REFO1CON1_ROSEL0_POSITION                          0x0
#define _REFO1CON1_ROSEL0_SIZE                              0x1
#define _REFO1CON1_ROSEL0_LENGTH                            0x1
#define _REFO1CON1_ROSEL0_MASK                              0x1
#define _REFO1CON1_ROSEL1_POSN                              0x1
#define _REFO1CON1_ROSEL1_POSITION                          0x1
#define _REFO1CON1_ROSEL1_SIZE                              0x1
#define _REFO1CON1_ROSEL1_LENGTH                            0x1
#define _REFO1CON1_ROSEL1_MASK                              0x2
#define _REFO1CON1_ROSEL2_POSN                              0x2
#define _REFO1CON1_ROSEL2_POSITION                          0x2
#define _REFO1CON1_ROSEL2_SIZE                              0x1
#define _REFO1CON1_ROSEL2_LENGTH                            0x1
#define _REFO1CON1_ROSEL2_MASK                              0x4
#define _REFO1CON1_ROSEL3_POSN                              0x3
#define _REFO1CON1_ROSEL3_POSITION                          0x3
#define _REFO1CON1_ROSEL3_SIZE                              0x1
#define _REFO1CON1_ROSEL3_LENGTH                            0x1
#define _REFO1CON1_ROSEL3_MASK                              0x8

// Register: REFO1CON
#define REFO1CON REFO1CON
extern volatile unsigned char           REFO1CON            __at(0xEE2);
#ifndef _LIB_BUILD
asm("REFO1CON equ 0EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACTIVE                 :1;
        unsigned DIVSWEN                :1;
        unsigned                        :1;
        unsigned ROSSLP                 :1;
        unsigned ROOE                   :1;
        unsigned ROSIDL                 :1;
        unsigned                        :1;
        unsigned ROON                   :1;
    };
} REFO1CONbits_t;
extern volatile REFO1CONbits_t REFO1CONbits __at(0xEE2);
// bitfield macros
#define _REFO1CON_ACTIVE_POSN                               0x0
#define _REFO1CON_ACTIVE_POSITION                           0x0
#define _REFO1CON_ACTIVE_SIZE                               0x1
#define _REFO1CON_ACTIVE_LENGTH                             0x1
#define _REFO1CON_ACTIVE_MASK                               0x1
#define _REFO1CON_DIVSWEN_POSN                              0x1
#define _REFO1CON_DIVSWEN_POSITION                          0x1
#define _REFO1CON_DIVSWEN_SIZE                              0x1
#define _REFO1CON_DIVSWEN_LENGTH                            0x1
#define _REFO1CON_DIVSWEN_MASK                              0x2
#define _REFO1CON_ROSSLP_POSN                               0x3
#define _REFO1CON_ROSSLP_POSITION                           0x3
#define _REFO1CON_ROSSLP_SIZE                               0x1
#define _REFO1CON_ROSSLP_LENGTH                             0x1
#define _REFO1CON_ROSSLP_MASK                               0x8
#define _REFO1CON_ROOE_POSN                                 0x4
#define _REFO1CON_ROOE_POSITION                             0x4
#define _REFO1CON_ROOE_SIZE                                 0x1
#define _REFO1CON_ROOE_LENGTH                               0x1
#define _REFO1CON_ROOE_MASK                                 0x10
#define _REFO1CON_ROSIDL_POSN                               0x5
#define _REFO1CON_ROSIDL_POSITION                           0x5
#define _REFO1CON_ROSIDL_SIZE                               0x1
#define _REFO1CON_ROSIDL_LENGTH                             0x1
#define _REFO1CON_ROSIDL_MASK                               0x20
#define _REFO1CON_ROON_POSN                                 0x7
#define _REFO1CON_ROON_POSITION                             0x7
#define _REFO1CON_ROON_SIZE                                 0x1
#define _REFO1CON_ROON_LENGTH                               0x1
#define _REFO1CON_ROON_MASK                                 0x80

// Register: MEMCON
#define MEMCON MEMCON
extern volatile unsigned char           MEMCON              __at(0xEE3);
#ifndef _LIB_BUILD
asm("MEMCON equ 0EE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WM                     :2;
        unsigned                        :2;
        unsigned WAIT                   :2;
        unsigned                        :1;
        unsigned EBDIS                  :1;
    };
    struct {
        unsigned WM0                    :1;
        unsigned WM1                    :1;
        unsigned                        :2;
        unsigned WAIT0                  :1;
        unsigned WAIT1                  :1;
    };
} MEMCONbits_t;
extern volatile MEMCONbits_t MEMCONbits __at(0xEE3);
// bitfield macros
#define _MEMCON_WM_POSN                                     0x0
#define _MEMCON_WM_POSITION                                 0x0
#define _MEMCON_WM_SIZE                                     0x2
#define _MEMCON_WM_LENGTH                                   0x2
#define _MEMCON_WM_MASK                                     0x3
#define _MEMCON_WAIT_POSN                                   0x4
#define _MEMCON_WAIT_POSITION                               0x4
#define _MEMCON_WAIT_SIZE                                   0x2
#define _MEMCON_WAIT_LENGTH                                 0x2
#define _MEMCON_WAIT_MASK                                   0x30
#define _MEMCON_EBDIS_POSN                                  0x7
#define _MEMCON_EBDIS_POSITION                              0x7
#define _MEMCON_EBDIS_SIZE                                  0x1
#define _MEMCON_EBDIS_LENGTH                                0x1
#define _MEMCON_EBDIS_MASK                                  0x80
#define _MEMCON_WM0_POSN                                    0x0
#define _MEMCON_WM0_POSITION                                0x0
#define _MEMCON_WM0_SIZE                                    0x1
#define _MEMCON_WM0_LENGTH                                  0x1
#define _MEMCON_WM0_MASK                                    0x1
#define _MEMCON_WM1_POSN                                    0x1
#define _MEMCON_WM1_POSITION                                0x1
#define _MEMCON_WM1_SIZE                                    0x1
#define _MEMCON_WM1_LENGTH                                  0x1
#define _MEMCON_WM1_MASK                                    0x2
#define _MEMCON_WAIT0_POSN                                  0x4
#define _MEMCON_WAIT0_POSITION                              0x4
#define _MEMCON_WAIT0_SIZE                                  0x1
#define _MEMCON_WAIT0_LENGTH                                0x1
#define _MEMCON_WAIT0_MASK                                  0x10
#define _MEMCON_WAIT1_POSN                                  0x5
#define _MEMCON_WAIT1_POSITION                              0x5
#define _MEMCON_WAIT1_SIZE                                  0x1
#define _MEMCON_WAIT1_LENGTH                                0x1
#define _MEMCON_WAIT1_MASK                                  0x20

// Register: PORTL
#define PORTL PORTL
extern volatile unsigned char           PORTL               __at(0xEE4);
#ifndef _LIB_BUILD
asm("PORTL equ 0EE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL0                    :1;
        unsigned RL1                    :1;
        unsigned RL2                    :1;
        unsigned RL3                    :1;
        unsigned RL4                    :1;
        unsigned RL5                    :1;
        unsigned RL6                    :1;
        unsigned RL7                    :1;
    };
} PORTLbits_t;
extern volatile PORTLbits_t PORTLbits __at(0xEE4);
// bitfield macros
#define _PORTL_RL0_POSN                                     0x0
#define _PORTL_RL0_POSITION                                 0x0
#define _PORTL_RL0_SIZE                                     0x1
#define _PORTL_RL0_LENGTH                                   0x1
#define _PORTL_RL0_MASK                                     0x1
#define _PORTL_RL1_POSN                                     0x1
#define _PORTL_RL1_POSITION                                 0x1
#define _PORTL_RL1_SIZE                                     0x1
#define _PORTL_RL1_LENGTH                                   0x1
#define _PORTL_RL1_MASK                                     0x2
#define _PORTL_RL2_POSN                                     0x2
#define _PORTL_RL2_POSITION                                 0x2
#define _PORTL_RL2_SIZE                                     0x1
#define _PORTL_RL2_LENGTH                                   0x1
#define _PORTL_RL2_MASK                                     0x4
#define _PORTL_RL3_POSN                                     0x3
#define _PORTL_RL3_POSITION                                 0x3
#define _PORTL_RL3_SIZE                                     0x1
#define _PORTL_RL3_LENGTH                                   0x1
#define _PORTL_RL3_MASK                                     0x8
#define _PORTL_RL4_POSN                                     0x4
#define _PORTL_RL4_POSITION                                 0x4
#define _PORTL_RL4_SIZE                                     0x1
#define _PORTL_RL4_LENGTH                                   0x1
#define _PORTL_RL4_MASK                                     0x10
#define _PORTL_RL5_POSN                                     0x5
#define _PORTL_RL5_POSITION                                 0x5
#define _PORTL_RL5_SIZE                                     0x1
#define _PORTL_RL5_LENGTH                                   0x1
#define _PORTL_RL5_MASK                                     0x20
#define _PORTL_RL6_POSN                                     0x6
#define _PORTL_RL6_POSITION                                 0x6
#define _PORTL_RL6_SIZE                                     0x1
#define _PORTL_RL6_LENGTH                                   0x1
#define _PORTL_RL6_MASK                                     0x40
#define _PORTL_RL7_POSN                                     0x7
#define _PORTL_RL7_POSITION                                 0x7
#define _PORTL_RL7_SIZE                                     0x1
#define _PORTL_RL7_LENGTH                                   0x1
#define _PORTL_RL7_MASK                                     0x80

// Register: LATL
#define LATL LATL
extern volatile unsigned char           LATL                __at(0xEE5);
#ifndef _LIB_BUILD
asm("LATL equ 0EE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATL0                  :1;
        unsigned LATL1                  :1;
        unsigned LATL2                  :1;
        unsigned LATL3                  :1;
        unsigned LATL4                  :1;
        unsigned LATL5                  :1;
        unsigned LATL6                  :1;
        unsigned LATL7                  :1;
    };
    struct {
        unsigned LL0                    :1;
        unsigned LL1                    :1;
        unsigned LL2                    :1;
        unsigned LL3                    :1;
        unsigned LL4                    :1;
        unsigned LL5                    :1;
        unsigned LL6                    :1;
        unsigned LL7                    :1;
    };
} LATLbits_t;
extern volatile LATLbits_t LATLbits __at(0xEE5);
// bitfield macros
#define _LATL_LATL0_POSN                                    0x0
#define _LATL_LATL0_POSITION                                0x0
#define _LATL_LATL0_SIZE                                    0x1
#define _LATL_LATL0_LENGTH                                  0x1
#define _LATL_LATL0_MASK                                    0x1
#define _LATL_LATL1_POSN                                    0x1
#define _LATL_LATL1_POSITION                                0x1
#define _LATL_LATL1_SIZE                                    0x1
#define _LATL_LATL1_LENGTH                                  0x1
#define _LATL_LATL1_MASK                                    0x2
#define _LATL_LATL2_POSN                                    0x2
#define _LATL_LATL2_POSITION                                0x2
#define _LATL_LATL2_SIZE                                    0x1
#define _LATL_LATL2_LENGTH                                  0x1
#define _LATL_LATL2_MASK                                    0x4
#define _LATL_LATL3_POSN                                    0x3
#define _LATL_LATL3_POSITION                                0x3
#define _LATL_LATL3_SIZE                                    0x1
#define _LATL_LATL3_LENGTH                                  0x1
#define _LATL_LATL3_MASK                                    0x8
#define _LATL_LATL4_POSN                                    0x4
#define _LATL_LATL4_POSITION                                0x4
#define _LATL_LATL4_SIZE                                    0x1
#define _LATL_LATL4_LENGTH                                  0x1
#define _LATL_LATL4_MASK                                    0x10
#define _LATL_LATL5_POSN                                    0x5
#define _LATL_LATL5_POSITION                                0x5
#define _LATL_LATL5_SIZE                                    0x1
#define _LATL_LATL5_LENGTH                                  0x1
#define _LATL_LATL5_MASK                                    0x20
#define _LATL_LATL6_POSN                                    0x6
#define _LATL_LATL6_POSITION                                0x6
#define _LATL_LATL6_SIZE                                    0x1
#define _LATL_LATL6_LENGTH                                  0x1
#define _LATL_LATL6_MASK                                    0x40
#define _LATL_LATL7_POSN                                    0x7
#define _LATL_LATL7_POSITION                                0x7
#define _LATL_LATL7_SIZE                                    0x1
#define _LATL_LATL7_LENGTH                                  0x1
#define _LATL_LATL7_MASK                                    0x80
#define _LATL_LL0_POSN                                      0x0
#define _LATL_LL0_POSITION                                  0x0
#define _LATL_LL0_SIZE                                      0x1
#define _LATL_LL0_LENGTH                                    0x1
#define _LATL_LL0_MASK                                      0x1
#define _LATL_LL1_POSN                                      0x1
#define _LATL_LL1_POSITION                                  0x1
#define _LATL_LL1_SIZE                                      0x1
#define _LATL_LL1_LENGTH                                    0x1
#define _LATL_LL1_MASK                                      0x2
#define _LATL_LL2_POSN                                      0x2
#define _LATL_LL2_POSITION                                  0x2
#define _LATL_LL2_SIZE                                      0x1
#define _LATL_LL2_LENGTH                                    0x1
#define _LATL_LL2_MASK                                      0x4
#define _LATL_LL3_POSN                                      0x3
#define _LATL_LL3_POSITION                                  0x3
#define _LATL_LL3_SIZE                                      0x1
#define _LATL_LL3_LENGTH                                    0x1
#define _LATL_LL3_MASK                                      0x8
#define _LATL_LL4_POSN                                      0x4
#define _LATL_LL4_POSITION                                  0x4
#define _LATL_LL4_SIZE                                      0x1
#define _LATL_LL4_LENGTH                                    0x1
#define _LATL_LL4_MASK                                      0x10
#define _LATL_LL5_POSN                                      0x5
#define _LATL_LL5_POSITION                                  0x5
#define _LATL_LL5_SIZE                                      0x1
#define _LATL_LL5_LENGTH                                    0x1
#define _LATL_LL5_MASK                                      0x20
#define _LATL_LL6_POSN                                      0x6
#define _LATL_LL6_POSITION                                  0x6
#define _LATL_LL6_SIZE                                      0x1
#define _LATL_LL6_LENGTH                                    0x1
#define _LATL_LL6_MASK                                      0x40
#define _LATL_LL7_POSN                                      0x7
#define _LATL_LL7_POSITION                                  0x7
#define _LATL_LL7_SIZE                                      0x1
#define _LATL_LL7_LENGTH                                    0x1
#define _LATL_LL7_MASK                                      0x80

// Register: TRISL
#define TRISL TRISL
extern volatile unsigned char           TRISL               __at(0xEE6);
#ifndef _LIB_BUILD
asm("TRISL equ 0EE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISL0                 :1;
        unsigned TRISL1                 :1;
        unsigned TRISL2                 :1;
        unsigned TRISL3                 :1;
        unsigned TRISL4                 :1;
        unsigned TRISL5                 :1;
        unsigned TRISL6                 :1;
        unsigned TRISL7                 :1;
    };
} TRISLbits_t;
extern volatile TRISLbits_t TRISLbits __at(0xEE6);
// bitfield macros
#define _TRISL_TRISL0_POSN                                  0x0
#define _TRISL_TRISL0_POSITION                              0x0
#define _TRISL_TRISL0_SIZE                                  0x1
#define _TRISL_TRISL0_LENGTH                                0x1
#define _TRISL_TRISL0_MASK                                  0x1
#define _TRISL_TRISL1_POSN                                  0x1
#define _TRISL_TRISL1_POSITION                              0x1
#define _TRISL_TRISL1_SIZE                                  0x1
#define _TRISL_TRISL1_LENGTH                                0x1
#define _TRISL_TRISL1_MASK                                  0x2
#define _TRISL_TRISL2_POSN                                  0x2
#define _TRISL_TRISL2_POSITION                              0x2
#define _TRISL_TRISL2_SIZE                                  0x1
#define _TRISL_TRISL2_LENGTH                                0x1
#define _TRISL_TRISL2_MASK                                  0x4
#define _TRISL_TRISL3_POSN                                  0x3
#define _TRISL_TRISL3_POSITION                              0x3
#define _TRISL_TRISL3_SIZE                                  0x1
#define _TRISL_TRISL3_LENGTH                                0x1
#define _TRISL_TRISL3_MASK                                  0x8
#define _TRISL_TRISL4_POSN                                  0x4
#define _TRISL_TRISL4_POSITION                              0x4
#define _TRISL_TRISL4_SIZE                                  0x1
#define _TRISL_TRISL4_LENGTH                                0x1
#define _TRISL_TRISL4_MASK                                  0x10
#define _TRISL_TRISL5_POSN                                  0x5
#define _TRISL_TRISL5_POSITION                              0x5
#define _TRISL_TRISL5_SIZE                                  0x1
#define _TRISL_TRISL5_LENGTH                                0x1
#define _TRISL_TRISL5_MASK                                  0x20
#define _TRISL_TRISL6_POSN                                  0x6
#define _TRISL_TRISL6_POSITION                              0x6
#define _TRISL_TRISL6_SIZE                                  0x1
#define _TRISL_TRISL6_LENGTH                                0x1
#define _TRISL_TRISL6_MASK                                  0x40
#define _TRISL_TRISL7_POSN                                  0x7
#define _TRISL_TRISL7_POSITION                              0x7
#define _TRISL_TRISL7_SIZE                                  0x1
#define _TRISL_TRISL7_LENGTH                                0x1
#define _TRISL_TRISL7_MASK                                  0x80

// Register: PORTK
#define PORTK PORTK
extern volatile unsigned char           PORTK               __at(0xEE7);
#ifndef _LIB_BUILD
asm("PORTK equ 0EE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RK0                    :1;
        unsigned RK1                    :1;
        unsigned RK2                    :1;
        unsigned RK3                    :1;
        unsigned RK4                    :1;
        unsigned RK5                    :1;
        unsigned RK6                    :1;
        unsigned RK7                    :1;
    };
} PORTKbits_t;
