MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
// Register: RCSTA4
#define RCSTA4 RCSTA4
extern volatile unsigned char           RCSTA4              __at(0xEFF);
#ifndef _LIB_BUILD
asm("RCSTA4 equ 0EFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned RCD84                  :1;
        unsigned                        :5;
        unsigned RC8_92                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC94                   :1;
    };
} RCSTA4bits_t;
extern volatile RCSTA4bits_t RCSTA4bits __at(0xEFF);
// bitfield macros
#define _RCSTA4_RX9D_POSN                                   0x0
#define _RCSTA4_RX9D_POSITION                               0x0
#define _RCSTA4_RX9D_SIZE                                   0x1
#define _RCSTA4_RX9D_LENGTH                                 0x1
#define _RCSTA4_RX9D_MASK                                   0x1
#define _RCSTA4_OERR_POSN                                   0x1
#define _RCSTA4_OERR_POSITION                               0x1
#define _RCSTA4_OERR_SIZE                                   0x1
#define _RCSTA4_OERR_LENGTH                                 0x1
#define _RCSTA4_OERR_MASK                                   0x2
#define _RCSTA4_FERR_POSN                                   0x2
#define _RCSTA4_FERR_POSITION                               0x2
#define _RCSTA4_FERR_SIZE                                   0x1
#define _RCSTA4_FERR_LENGTH                                 0x1
#define _RCSTA4_FERR_MASK                                   0x4
#define _RCSTA4_ADDEN_POSN                                  0x3
#define _RCSTA4_ADDEN_POSITION                              0x3
#define _RCSTA4_ADDEN_SIZE                                  0x1
#define _RCSTA4_ADDEN_LENGTH                                0x1
#define _RCSTA4_ADDEN_MASK                                  0x8
#define _RCSTA4_CREN_POSN                                   0x4
#define _RCSTA4_CREN_POSITION                               0x4
#define _RCSTA4_CREN_SIZE                                   0x1
#define _RCSTA4_CREN_LENGTH                                 0x1
#define _RCSTA4_CREN_MASK                                   0x10
#define _RCSTA4_SREN_POSN                                   0x5
#define _RCSTA4_SREN_POSITION                               0x5
#define _RCSTA4_SREN_SIZE                                   0x1
#define _RCSTA4_SREN_LENGTH                                 0x1
#define _RCSTA4_SREN_MASK                                   0x20
#define _RCSTA4_RX9_POSN                                    0x6
#define _RCSTA4_RX9_POSITION                                0x6
#define _RCSTA4_RX9_SIZE                                    0x1
#define _RCSTA4_RX9_LENGTH                                  0x1
#define _RCSTA4_RX9_MASK                                    0x40
#define _RCSTA4_SPEN_POSN                                   0x7
#define _RCSTA4_SPEN_POSITION                               0x7
#define _RCSTA4_SPEN_SIZE                                   0x1
#define _RCSTA4_SPEN_LENGTH                                 0x1
#define _RCSTA4_SPEN_MASK                                   0x80
#define _RCSTA4_RCD84_POSN                                  0x0
#define _RCSTA4_RCD84_POSITION                              0x0
#define _RCSTA4_RCD84_SIZE                                  0x1
#define _RCSTA4_RCD84_LENGTH                                0x1
#define _RCSTA4_RCD84_MASK                                  0x1
#define _RCSTA4_RC8_92_POSN                                 0x6
#define _RCSTA4_RC8_92_POSITION                             0x6
#define _RCSTA4_RC8_92_SIZE                                 0x1
#define _RCSTA4_RC8_92_LENGTH                               0x1
#define _RCSTA4_RC8_92_MASK                                 0x40
#define _RCSTA4_RC94_POSN                                   0x6
#define _RCSTA4_RC94_POSITION                               0x6
#define _RCSTA4_RC94_SIZE                                   0x1
#define _RCSTA4_RC94_LENGTH                                 0x1
#define _RCSTA4_RC94_MASK                                   0x40

// Register: DMACON2
#define DMACON2 DMACON2
extern volatile unsigned char           DMACON2             __at(0xF00);
#ifndef _LIB_BUILD
asm("DMACON2 equ 0F00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTLVL                 :4;
        unsigned DLYCYC                 :4;
    };
    struct {
        unsigned INTLVL0                :1;
        unsigned INTLVL1                :1;
        unsigned INTLVL2                :1;
        unsigned INTLVL3                :1;
        unsigned DLYCYC0                :1;
        unsigned DLYCYC1                :1;
        unsigned DLYCYC2                :1;
        unsigned DLYCYC3                :1;
    };
} DMACON2bits_t;
extern volatile DMACON2bits_t DMACON2bits __at(0xF00);
// bitfield macros
#define _DMACON2_INTLVL_POSN                                0x0
#define _DMACON2_INTLVL_POSITION                            0x0
#define _DMACON2_INTLVL_SIZE                                0x4
#define _DMACON2_INTLVL_LENGTH                              0x4
#define _DMACON2_INTLVL_MASK                                0xF
#define _DMACON2_DLYCYC_POSN                                0x4
#define _DMACON2_DLYCYC_POSITION                            0x4
#define _DMACON2_DLYCYC_SIZE                                0x4
#define _DMACON2_DLYCYC_LENGTH                              0x4
#define _DMACON2_DLYCYC_MASK                                0xF0
#define _DMACON2_INTLVL0_POSN                               0x0
#define _DMACON2_INTLVL0_POSITION                           0x0
#define _DMACON2_INTLVL0_SIZE                               0x1
#define _DMACON2_INTLVL0_LENGTH                             0x1
#define _DMACON2_INTLVL0_MASK                               0x1
#define _DMACON2_INTLVL1_POSN                               0x1
#define _DMACON2_INTLVL1_POSITION                           0x1
#define _DMACON2_INTLVL1_SIZE                               0x1
#define _DMACON2_INTLVL1_LENGTH                             0x1
#define _DMACON2_INTLVL1_MASK                               0x2
#define _DMACON2_INTLVL2_POSN                               0x2
#define _DMACON2_INTLVL2_POSITION                           0x2
#define _DMACON2_INTLVL2_SIZE                               0x1
#define _DMACON2_INTLVL2_LENGTH                             0x1
#define _DMACON2_INTLVL2_MASK                               0x4
#define _DMACON2_INTLVL3_POSN                               0x3
#define _DMACON2_INTLVL3_POSITION                           0x3
#define _DMACON2_INTLVL3_SIZE                               0x1
#define _DMACON2_INTLVL3_LENGTH                             0x1
#define _DMACON2_INTLVL3_MASK                               0x8
#define _DMACON2_DLYCYC0_POSN                               0x4
#define _DMACON2_DLYCYC0_POSITION                           0x4
#define _DMACON2_DLYCYC0_SIZE                               0x1
#define _DMACON2_DLYCYC0_LENGTH                             0x1
#define _DMACON2_DLYCYC0_MASK                               0x10
#define _DMACON2_DLYCYC1_POSN                               0x5
#define _DMACON2_DLYCYC1_POSITION                           0x5
#define _DMACON2_DLYCYC1_SIZE                               0x1
#define _DMACON2_DLYCYC1_LENGTH                             0x1
#define _DMACON2_DLYCYC1_MASK                               0x20
#define _DMACON2_DLYCYC2_POSN                               0x6
#define _DMACON2_DLYCYC2_POSITION                           0x6
#define _DMACON2_DLYCYC2_SIZE                               0x1
#define _DMACON2_DLYCYC2_LENGTH                             0x1
#define _DMACON2_DLYCYC2_MASK                               0x40
#define _DMACON2_DLYCYC3_POSN                               0x7
#define _DMACON2_DLYCYC3_POSITION                           0x7
#define _DMACON2_DLYCYC3_SIZE                               0x1
#define _DMACON2_DLYCYC3_LENGTH                             0x1
#define _DMACON2_DLYCYC3_MASK                               0x80

// Register: ANCFG
#define ANCFG ANCFG
extern volatile unsigned char           ANCFG               __at(0xF01);
#ifndef _LIB_BUILD
asm("ANCFG equ 0F01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VBGEN                  :1;
        unsigned VBG2EN                 :1;
        unsigned VBG6EN                 :1;
    };
} ANCFGbits_t;
extern volatile ANCFGbits_t ANCFGbits __at(0xF01);
// bitfield macros
#define _ANCFG_VBGEN_POSN                                   0x0
#define _ANCFG_VBGEN_POSITION                               0x0
#define _ANCFG_VBGEN_SIZE                                   0x1
#define _ANCFG_VBGEN_LENGTH                                 0x1
#define _ANCFG_VBGEN_MASK                                   0x1
#define _ANCFG_VBG2EN_POSN                                  0x1
#define _ANCFG_VBG2EN_POSITION                              0x1
#define _ANCFG_VBG2EN_SIZE                                  0x1
#define _ANCFG_VBG2EN_LENGTH                                0x1
#define _ANCFG_VBG2EN_MASK                                  0x2
#define _ANCFG_VBG6EN_POSN                                  0x2
#define _ANCFG_VBG6EN_POSITION                              0x2
#define _ANCFG_VBG6EN_SIZE                                  0x1
#define _ANCFG_VBG6EN_LENGTH                                0x1
#define _ANCFG_VBG6EN_MASK                                  0x4

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
extern volatile unsigned char           SSP2ADD             __at(0xF02);
#ifndef _LIB_BUILD
asm("SSP2ADD equ 0F02h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPADD                 :8;
    };
    struct {
        unsigned MSK02                  :1;
        unsigned MSK12                  :1;
        unsigned MSK22                  :1;
        unsigned MSK32                  :1;
        unsigned MSK42                  :1;
        unsigned MSK52                  :1;
        unsigned MSK62                  :1;
        unsigned MSK72                  :1;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
} SSP2ADDbits_t;
extern volatile SSP2ADDbits_t SSP2ADDbits __at(0xF02);
// bitfield macros
#define _SSP2ADD_SSPADD_POSN                                0x0
#define _SSP2ADD_SSPADD_POSITION                            0x0
#define _SSP2ADD_SSPADD_SIZE                                0x8
#define _SSP2ADD_SSPADD_LENGTH                              0x8
#define _SSP2ADD_SSPADD_MASK                                0xFF
#define _SSP2ADD_MSK02_POSN                                 0x0
#define _SSP2ADD_MSK02_POSITION                             0x0
#define _SSP2ADD_MSK02_SIZE                                 0x1
#define _SSP2ADD_MSK02_LENGTH                               0x1
#define _SSP2ADD_MSK02_MASK                                 0x1
#define _SSP2ADD_MSK12_POSN                                 0x1
#define _SSP2ADD_MSK12_POSITION                             0x1
#define _SSP2ADD_MSK12_SIZE                                 0x1
#define _SSP2ADD_MSK12_LENGTH                               0x1
#define _SSP2ADD_MSK12_MASK                                 0x2
#define _SSP2ADD_MSK22_POSN                                 0x2
#define _SSP2ADD_MSK22_POSITION                             0x2
#define _SSP2ADD_MSK22_SIZE                                 0x1
#define _SSP2ADD_MSK22_LENGTH                               0x1
#define _SSP2ADD_MSK22_MASK                                 0x4
#define _SSP2ADD_MSK32_POSN                                 0x3
#define _SSP2ADD_MSK32_POSITION                             0x3
#define _SSP2ADD_MSK32_SIZE                                 0x1
#define _SSP2ADD_MSK32_LENGTH                               0x1
#define _SSP2ADD_MSK32_MASK                                 0x8
#define _SSP2ADD_MSK42_POSN                                 0x4
#define _SSP2ADD_MSK42_POSITION                             0x4
#define _SSP2ADD_MSK42_SIZE                                 0x1
#define _SSP2ADD_MSK42_LENGTH                               0x1
#define _SSP2ADD_MSK42_MASK                                 0x10
#define _SSP2ADD_MSK52_POSN                                 0x5
#define _SSP2ADD_MSK52_POSITION                             0x5
#define _SSP2ADD_MSK52_SIZE                                 0x1
#define _SSP2ADD_MSK52_LENGTH                               0x1
#define _SSP2ADD_MSK52_MASK                                 0x20
#define _SSP2ADD_MSK62_POSN                                 0x6
#define _SSP2ADD_MSK62_POSITION                             0x6
#define _SSP2ADD_MSK62_SIZE                                 0x1
#define _SSP2ADD_MSK62_LENGTH                               0x1
#define _SSP2ADD_MSK62_MASK                                 0x40
#define _SSP2ADD_MSK72_POSN                                 0x7
#define _SSP2ADD_MSK72_POSITION                             0x7
#define _SSP2ADD_MSK72_SIZE                                 0x1
#define _SSP2ADD_MSK72_LENGTH                               0x1
#define _SSP2ADD_MSK72_MASK                                 0x80
#define _SSP2ADD_MSK0_POSN                                  0x0
#define _SSP2ADD_MSK0_POSITION                              0x0
#define _SSP2ADD_MSK0_SIZE                                  0x1
#define _SSP2ADD_MSK0_LENGTH                                0x1
#define _SSP2ADD_MSK0_MASK                                  0x1
#define _SSP2ADD_MSK1_POSN                                  0x1
#define _SSP2ADD_MSK1_POSITION                              0x1
#define _SSP2ADD_MSK1_SIZE                                  0x1
#define _SSP2ADD_MSK1_LENGTH                                0x1
#define _SSP2ADD_MSK1_MASK                                  0x2
#define _SSP2ADD_MSK2_POSN                                  0x2
#define _SSP2ADD_MSK2_POSITION                              0x2
#define _SSP2ADD_MSK2_SIZE                                  0x1
#define _SSP2ADD_MSK2_LENGTH                                0x1
#define _SSP2ADD_MSK2_MASK                                  0x4
#define _SSP2ADD_MSK3_POSN                                  0x3
#define _SSP2ADD_MSK3_POSITION                              0x3
#define _SSP2ADD_MSK3_SIZE                                  0x1
#define _SSP2ADD_MSK3_LENGTH                                0x1
#define _SSP2ADD_MSK3_MASK                                  0x8
#define _SSP2ADD_MSK4_POSN                                  0x4
#define _SSP2ADD_MSK4_POSITION                              0x4
#define _SSP2ADD_MSK4_SIZE                                  0x1
#define _SSP2ADD_MSK4_LENGTH                                0x1
#define _SSP2ADD_MSK4_MASK                                  0x10
#define _SSP2ADD_MSK5_POSN                                  0x5
#define _SSP2ADD_MSK5_POSITION                              0x5
#define _SSP2ADD_MSK5_SIZE                                  0x1
#define _SSP2ADD_MSK5_LENGTH                                0x1
#define _SSP2ADD_MSK5_MASK                                  0x20
#define _SSP2ADD_MSK6_POSN                                  0x6
#define _SSP2ADD_MSK6_POSITION                              0x6
#define _SSP2ADD_MSK6_SIZE                                  0x1
#define _SSP2ADD_MSK6_LENGTH                                0x1
#define _SSP2ADD_MSK6_MASK                                  0x40
#define _SSP2ADD_MSK7_POSN                                  0x7
#define _SSP2ADD_MSK7_POSITION                              0x7
#define _SSP2ADD_MSK7_SIZE                                  0x1
#define _SSP2ADD_MSK7_LENGTH                                0x1
#define _SSP2ADD_MSK7_MASK                                  0x80

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
extern volatile unsigned char           SSP2BUF             __at(0xF03);
#ifndef _LIB_BUILD
asm("SSP2BUF equ 0F03h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPBUF                 :8;
    };
} SSP2BUFbits_t;
