MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
// Register: SPBRG2
#define SPBRG2 SPBRG2
extern volatile unsigned char           SPBRG2              __at(0xF1F);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRG2                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRG2bits_t;
extern volatile SPBRG2bits_t SPBRG2bits __at(0xF1F);
// bitfield macros
#define _SPBRG2_SPBRG2_POSN                                 0x0
#define _SPBRG2_SPBRG2_POSITION                             0x0
#define _SPBRG2_SPBRG2_SIZE                                 0x8
#define _SPBRG2_SPBRG2_LENGTH                               0x8
#define _SPBRG2_SPBRG2_MASK                                 0xFF
#define _SPBRG2_BRG0_POSN                                   0x0
#define _SPBRG2_BRG0_POSITION                               0x0
#define _SPBRG2_BRG0_SIZE                                   0x1
#define _SPBRG2_BRG0_LENGTH                                 0x1
#define _SPBRG2_BRG0_MASK                                   0x1
#define _SPBRG2_BRG1_POSN                                   0x1
#define _SPBRG2_BRG1_POSITION                               0x1
#define _SPBRG2_BRG1_SIZE                                   0x1
#define _SPBRG2_BRG1_LENGTH                                 0x1
#define _SPBRG2_BRG1_MASK                                   0x2
#define _SPBRG2_BRG2_POSN                                   0x2
#define _SPBRG2_BRG2_POSITION                               0x2
#define _SPBRG2_BRG2_SIZE                                   0x1
#define _SPBRG2_BRG2_LENGTH                                 0x1
#define _SPBRG2_BRG2_MASK                                   0x4
#define _SPBRG2_BRG3_POSN                                   0x3
#define _SPBRG2_BRG3_POSITION                               0x3
#define _SPBRG2_BRG3_SIZE                                   0x1
#define _SPBRG2_BRG3_LENGTH                                 0x1
#define _SPBRG2_BRG3_MASK                                   0x8
#define _SPBRG2_BRG4_POSN                                   0x4
#define _SPBRG2_BRG4_POSITION                               0x4
#define _SPBRG2_BRG4_SIZE                                   0x1
#define _SPBRG2_BRG4_LENGTH                                 0x1
#define _SPBRG2_BRG4_MASK                                   0x10
#define _SPBRG2_BRG5_POSN                                   0x5
#define _SPBRG2_BRG5_POSITION                               0x5
#define _SPBRG2_BRG5_SIZE                                   0x1
#define _SPBRG2_BRG5_LENGTH                                 0x1
#define _SPBRG2_BRG5_MASK                                   0x20
#define _SPBRG2_BRG6_POSN                                   0x6
#define _SPBRG2_BRG6_POSITION                               0x6
#define _SPBRG2_BRG6_SIZE                                   0x1
#define _SPBRG2_BRG6_LENGTH                                 0x1
#define _SPBRG2_BRG6_MASK                                   0x40
#define _SPBRG2_BRG7_POSN                                   0x7
#define _SPBRG2_BRG7_POSITION                               0x7
#define _SPBRG2_BRG7_SIZE                                   0x1
#define _SPBRG2_BRG7_LENGTH                                 0x1
#define _SPBRG2_BRG7_MASK                                   0x80

// Register: SPBRGH2
#define SPBRGH2 SPBRGH2
extern volatile unsigned char           SPBRGH2             __at(0xF20);
#ifndef _LIB_BUILD
asm("SPBRGH2 equ 0F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH2                :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGH2bits_t;
extern volatile SPBRGH2bits_t SPBRGH2bits __at(0xF20);
// bitfield macros
#define _SPBRGH2_SPBRGH2_POSN                               0x0
#define _SPBRGH2_SPBRGH2_POSITION                           0x0
#define _SPBRGH2_SPBRGH2_SIZE                               0x8
#define _SPBRGH2_SPBRGH2_LENGTH                             0x8
#define _SPBRGH2_SPBRGH2_MASK                               0xFF
#define _SPBRGH2_BRG8_POSN                                  0x0
#define _SPBRGH2_BRG8_POSITION                              0x0
#define _SPBRGH2_BRG8_SIZE                                  0x1
#define _SPBRGH2_BRG8_LENGTH                                0x1
#define _SPBRGH2_BRG8_MASK                                  0x1
#define _SPBRGH2_BRG9_POSN                                  0x1
#define _SPBRGH2_BRG9_POSITION                              0x1
#define _SPBRGH2_BRG9_SIZE                                  0x1
#define _SPBRGH2_BRG9_LENGTH                                0x1
#define _SPBRGH2_BRG9_MASK                                  0x2
#define _SPBRGH2_BRG10_POSN                                 0x2
#define _SPBRGH2_BRG10_POSITION                             0x2
#define _SPBRGH2_BRG10_SIZE                                 0x1
#define _SPBRGH2_BRG10_LENGTH                               0x1
#define _SPBRGH2_BRG10_MASK                                 0x4
#define _SPBRGH2_BRG11_POSN                                 0x3
#define _SPBRGH2_BRG11_POSITION                             0x3
#define _SPBRGH2_BRG11_SIZE                                 0x1
#define _SPBRGH2_BRG11_LENGTH                               0x1
#define _SPBRGH2_BRG11_MASK                                 0x8
#define _SPBRGH2_BRG12_POSN                                 0x4
#define _SPBRGH2_BRG12_POSITION                             0x4
#define _SPBRGH2_BRG12_SIZE                                 0x1
#define _SPBRGH2_BRG12_LENGTH                               0x1
#define _SPBRGH2_BRG12_MASK                                 0x10
#define _SPBRGH2_BRG13_POSN                                 0x5
#define _SPBRGH2_BRG13_POSITION                             0x5
#define _SPBRGH2_BRG13_SIZE                                 0x1
#define _SPBRGH2_BRG13_LENGTH                               0x1
#define _SPBRGH2_BRG13_MASK                                 0x20
#define _SPBRGH2_BRG14_POSN                                 0x6
#define _SPBRGH2_BRG14_POSITION                             0x6
#define _SPBRGH2_BRG14_SIZE                                 0x1
#define _SPBRGH2_BRG14_LENGTH                               0x1
#define _SPBRGH2_BRG14_MASK                                 0x40
#define _SPBRGH2_BRG15_POSN                                 0x7
#define _SPBRGH2_BRG15_POSITION                             0x7
#define _SPBRGH2_BRG15_SIZE                                 0x1
#define _SPBRGH2_BRG15_LENGTH                               0x1
#define _SPBRGH2_BRG15_MASK                                 0x80

// Register: DSGPR3
#define DSGPR3 DSGPR3
extern volatile unsigned char           DSGPR3              __at(0xF21);
#ifndef _LIB_BUILD
asm("DSGPR3 equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR3                 :8;
    };
} DSGPR3bits_t;
extern volatile DSGPR3bits_t DSGPR3bits __at(0xF21);
// bitfield macros
#define _DSGPR3_DSGPR3_POSN                                 0x0
#define _DSGPR3_DSGPR3_POSITION                             0x0
#define _DSGPR3_DSGPR3_SIZE                                 0x8
#define _DSGPR3_DSGPR3_LENGTH                               0x8
#define _DSGPR3_DSGPR3_MASK                                 0xFF

// Register: DSGPR2
#define DSGPR2 DSGPR2
extern volatile unsigned char           DSGPR2              __at(0xF22);
#ifndef _LIB_BUILD
asm("DSGPR2 equ 0F22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR2                 :8;
    };
} DSGPR2bits_t;
