MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
extern volatile ACTCONbits_t ACTCONbits __at(0xF63);
// bitfield macros
#define _ACTCON_ACTORSPOL_POSN                              0x0
#define _ACTCON_ACTORSPOL_POSITION                          0x0
#define _ACTCON_ACTORSPOL_SIZE                              0x1
#define _ACTCON_ACTORSPOL_LENGTH                            0x1
#define _ACTCON_ACTORSPOL_MASK                              0x1
#define _ACTCON_ACTORS_POSN                                 0x1
#define _ACTCON_ACTORS_POSITION                             0x1
#define _ACTCON_ACTORS_SIZE                                 0x1
#define _ACTCON_ACTORS_LENGTH                               0x1
#define _ACTCON_ACTORS_MASK                                 0x2
#define _ACTCON_ACTLOCKPOL_POSN                             0x2
#define _ACTCON_ACTLOCKPOL_POSITION                         0x2
#define _ACTCON_ACTLOCKPOL_SIZE                             0x1
#define _ACTCON_ACTLOCKPOL_LENGTH                           0x1
#define _ACTCON_ACTLOCKPOL_MASK                             0x4
#define _ACTCON_ACTLOCK_POSN                                0x3
#define _ACTCON_ACTLOCK_POSITION                            0x3
#define _ACTCON_ACTLOCK_SIZE                                0x1
#define _ACTCON_ACTLOCK_LENGTH                              0x1
#define _ACTCON_ACTLOCK_MASK                                0x8
#define _ACTCON_ACTSRC_POSN                                 0x4
#define _ACTCON_ACTSRC_POSITION                             0x4
#define _ACTCON_ACTSRC_SIZE                                 0x1
#define _ACTCON_ACTSRC_LENGTH                               0x1
#define _ACTCON_ACTSRC_MASK                                 0x10
#define _ACTCON_ACTSIDL_POSN                                0x5
#define _ACTCON_ACTSIDL_POSITION                            0x5
#define _ACTCON_ACTSIDL_SIZE                                0x1
#define _ACTCON_ACTSIDL_LENGTH                              0x1
#define _ACTCON_ACTSIDL_MASK                                0x20
#define _ACTCON_ACTEN_POSN                                  0x7
#define _ACTCON_ACTEN_POSITION                              0x7
#define _ACTCON_ACTEN_SIZE                                  0x1
#define _ACTCON_ACTEN_LENGTH                                0x1
#define _ACTCON_ACTEN_MASK                                  0x80

// Register: OSCCON4
#define OSCCON4 OSCCON4
extern volatile unsigned char           OSCCON4             __at(0xF64);
#ifndef _LIB_BUILD
asm("OSCCON4 equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned PLLEN                  :1;
        unsigned CPDIV                  :2;
    };
    struct {
        unsigned                        :6;
        unsigned CPDIV0                 :1;
        unsigned CPDIV1                 :1;
    };
} OSCCON4bits_t;
extern volatile OSCCON4bits_t OSCCON4bits __at(0xF64);
// bitfield macros
#define _OSCCON4_PLLEN_POSN                                 0x5
#define _OSCCON4_PLLEN_POSITION                             0x5
#define _OSCCON4_PLLEN_SIZE                                 0x1
#define _OSCCON4_PLLEN_LENGTH                               0x1
#define _OSCCON4_PLLEN_MASK                                 0x20
#define _OSCCON4_CPDIV_POSN                                 0x6
#define _OSCCON4_CPDIV_POSITION                             0x6
#define _OSCCON4_CPDIV_SIZE                                 0x2
#define _OSCCON4_CPDIV_LENGTH                               0x2
#define _OSCCON4_CPDIV_MASK                                 0xC0
#define _OSCCON4_CPDIV0_POSN                                0x6
#define _OSCCON4_CPDIV0_POSITION                            0x6
#define _OSCCON4_CPDIV0_SIZE                                0x1
#define _OSCCON4_CPDIV0_LENGTH                              0x1
#define _OSCCON4_CPDIV0_MASK                                0x40
#define _OSCCON4_CPDIV1_POSN                                0x7
#define _OSCCON4_CPDIV1_POSITION                            0x7
#define _OSCCON4_CPDIV1_SIZE                                0x1
#define _OSCCON4_CPDIV1_LENGTH                              0x1
#define _OSCCON4_CPDIV1_MASK                                0x80

// Register: OSCCON3
#define OSCCON3 OSCCON3
extern volatile unsigned char           OSCCON3             __at(0xF65);
#ifndef _LIB_BUILD
asm("OSCCON3 equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IRCF                   :3;
    };
    struct {
        unsigned IRCF0                  :1;
        unsigned IRCF1                  :1;
        unsigned IRCF2                  :1;
    };
} OSCCON3bits_t;
extern volatile OSCCON3bits_t OSCCON3bits __at(0xF65);
// bitfield macros
#define _OSCCON3_IRCF_POSN                                  0x0
#define _OSCCON3_IRCF_POSITION                              0x0
#define _OSCCON3_IRCF_SIZE                                  0x3
#define _OSCCON3_IRCF_LENGTH                                0x3
#define _OSCCON3_IRCF_MASK                                  0x7
#define _OSCCON3_IRCF0_POSN                                 0x0
#define _OSCCON3_IRCF0_POSITION                             0x0
#define _OSCCON3_IRCF0_SIZE                                 0x1
#define _OSCCON3_IRCF0_LENGTH                               0x1
#define _OSCCON3_IRCF0_MASK                                 0x1
#define _OSCCON3_IRCF1_POSN                                 0x1
#define _OSCCON3_IRCF1_POSITION                             0x1
#define _OSCCON3_IRCF1_SIZE                                 0x1
#define _OSCCON3_IRCF1_LENGTH                               0x1
#define _OSCCON3_IRCF1_MASK                                 0x2
#define _OSCCON3_IRCF2_POSN                                 0x2
#define _OSCCON3_IRCF2_POSITION                             0x2
#define _OSCCON3_IRCF2_SIZE                                 0x1
#define _OSCCON3_IRCF2_LENGTH                               0x1
#define _OSCCON3_IRCF2_MASK                                 0x4

// Register: OSCCON2
#define OSCCON2 OSCCON2
extern volatile unsigned char           OSCCON2             __at(0xF66);
#ifndef _LIB_BUILD
asm("OSCCON2 equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned SOSCGO                 :1;
        unsigned POSCEN                 :1;
        unsigned CF                     :1;
        unsigned                        :1;
        unsigned LOCK                   :1;
        unsigned IOLOCK                 :1;
        unsigned CLKLOCK                :1;
    };
} OSCCON2bits_t;
extern volatile OSCCON2bits_t OSCCON2bits __at(0xF66);
// bitfield macros
#define _OSCCON2_SOSCGO_POSN                                0x1
#define _OSCCON2_SOSCGO_POSITION                            0x1
#define _OSCCON2_SOSCGO_SIZE                                0x1
#define _OSCCON2_SOSCGO_LENGTH                              0x1
#define _OSCCON2_SOSCGO_MASK                                0x2
#define _OSCCON2_POSCEN_POSN                                0x2
#define _OSCCON2_POSCEN_POSITION                            0x2
#define _OSCCON2_POSCEN_SIZE                                0x1
#define _OSCCON2_POSCEN_LENGTH                              0x1
#define _OSCCON2_POSCEN_MASK                                0x4
#define _OSCCON2_CF_POSN                                    0x3
#define _OSCCON2_CF_POSITION                                0x3
#define _OSCCON2_CF_SIZE                                    0x1
#define _OSCCON2_CF_LENGTH                                  0x1
#define _OSCCON2_CF_MASK                                    0x8
#define _OSCCON2_LOCK_POSN                                  0x5
#define _OSCCON2_LOCK_POSITION                              0x5
#define _OSCCON2_LOCK_SIZE                                  0x1
#define _OSCCON2_LOCK_LENGTH                                0x1
#define _OSCCON2_LOCK_MASK                                  0x20
#define _OSCCON2_IOLOCK_POSN                                0x6
#define _OSCCON2_IOLOCK_POSITION                            0x6
#define _OSCCON2_IOLOCK_SIZE                                0x1
#define _OSCCON2_IOLOCK_LENGTH                              0x1
#define _OSCCON2_IOLOCK_MASK                                0x40
#define _OSCCON2_CLKLOCK_POSN                               0x7
#define _OSCCON2_CLKLOCK_POSITION                           0x7
#define _OSCCON2_CLKLOCK_SIZE                               0x1
#define _OSCCON2_CLKLOCK_LENGTH                             0x1
#define _OSCCON2_CLKLOCK_MASK                               0x80

// Register: BAUDCON1
#define BAUDCON1 BAUDCON1
extern volatile unsigned char           BAUDCON1            __at(0xF67);
#ifndef _LIB_BUILD
asm("BAUDCON1 equ 0F67h");
#endif
// aliases
extern volatile unsigned char           BAUDCON             __at(0xF67);
#ifndef _LIB_BUILD
asm("BAUDCON equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned IREN                   :1;
        unsigned BRG16                  :1;
        unsigned TXCKP                  :1;
        unsigned RXDTP                  :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKTXP                  :1;
        unsigned DTRXP                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCMT                   :1;
    };
    struct {
        unsigned ABDEN1                 :1;
        unsigned WUE1                   :1;
        unsigned                        :1;
        unsigned BRG161                 :1;
        unsigned SCKP1                  :1;
        unsigned DTRXP1                 :1;
        unsigned RCIDL1                 :1;
        unsigned ABDOVF1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP1                 :1;
        unsigned RXDTP1                 :1;
        unsigned RCMT1                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXCKP                  :1;
    };
} BAUDCON1bits_t;
extern volatile BAUDCON1bits_t BAUDCON1bits __at(0xF67);
// bitfield macros
#define _BAUDCON1_ABDEN_POSN                                0x0
#define _BAUDCON1_ABDEN_POSITION                            0x0
#define _BAUDCON1_ABDEN_SIZE                                0x1
#define _BAUDCON1_ABDEN_LENGTH                              0x1
#define _BAUDCON1_ABDEN_MASK                                0x1
#define _BAUDCON1_WUE_POSN                                  0x1
#define _BAUDCON1_WUE_POSITION                              0x1
#define _BAUDCON1_WUE_SIZE                                  0x1
#define _BAUDCON1_WUE_LENGTH                                0x1
#define _BAUDCON1_WUE_MASK                                  0x2
#define _BAUDCON1_IREN_POSN                                 0x2
#define _BAUDCON1_IREN_POSITION                             0x2
#define _BAUDCON1_IREN_SIZE                                 0x1
#define _BAUDCON1_IREN_LENGTH                               0x1
#define _BAUDCON1_IREN_MASK                                 0x4
#define _BAUDCON1_BRG16_POSN                                0x3
#define _BAUDCON1_BRG16_POSITION                            0x3
#define _BAUDCON1_BRG16_SIZE                                0x1
#define _BAUDCON1_BRG16_LENGTH                              0x1
#define _BAUDCON1_BRG16_MASK                                0x8
#define _BAUDCON1_TXCKP_POSN                                0x4
#define _BAUDCON1_TXCKP_POSITION                            0x4
#define _BAUDCON1_TXCKP_SIZE                                0x1
#define _BAUDCON1_TXCKP_LENGTH                              0x1
#define _BAUDCON1_TXCKP_MASK                                0x10
#define _BAUDCON1_RXDTP_POSN                                0x5
#define _BAUDCON1_RXDTP_POSITION                            0x5
#define _BAUDCON1_RXDTP_SIZE                                0x1
#define _BAUDCON1_RXDTP_LENGTH                              0x1
#define _BAUDCON1_RXDTP_MASK                                0x20
#define _BAUDCON1_RCIDL_POSN                                0x6
#define _BAUDCON1_RCIDL_POSITION                            0x6
#define _BAUDCON1_RCIDL_SIZE                                0x1
#define _BAUDCON1_RCIDL_LENGTH                              0x1
#define _BAUDCON1_RCIDL_MASK                                0x40
#define _BAUDCON1_ABDOVF_POSN                               0x7
#define _BAUDCON1_ABDOVF_POSITION                           0x7
#define _BAUDCON1_ABDOVF_SIZE                               0x1
#define _BAUDCON1_ABDOVF_LENGTH                             0x1
#define _BAUDCON1_ABDOVF_MASK                               0x80
#define _BAUDCON1_CKTXP_POSN                                0x4
#define _BAUDCON1_CKTXP_POSITION                            0x4
#define _BAUDCON1_CKTXP_SIZE                                0x1
#define _BAUDCON1_CKTXP_LENGTH                              0x1
#define _BAUDCON1_CKTXP_MASK                                0x10
#define _BAUDCON1_DTRXP_POSN                                0x5
#define _BAUDCON1_DTRXP_POSITION                            0x5
#define _BAUDCON1_DTRXP_SIZE                                0x1
#define _BAUDCON1_DTRXP_LENGTH                              0x1
#define _BAUDCON1_DTRXP_MASK                                0x20
#define _BAUDCON1_SCKP_POSN                                 0x4
#define _BAUDCON1_SCKP_POSITION                             0x4
#define _BAUDCON1_SCKP_SIZE                                 0x1
#define _BAUDCON1_SCKP_LENGTH                               0x1
#define _BAUDCON1_SCKP_MASK                                 0x10
#define _BAUDCON1_RCMT_POSN                                 0x6
#define _BAUDCON1_RCMT_POSITION                             0x6
#define _BAUDCON1_RCMT_SIZE                                 0x1
#define _BAUDCON1_RCMT_LENGTH                               0x1
#define _BAUDCON1_RCMT_MASK                                 0x40
#define _BAUDCON1_ABDEN1_POSN                               0x0
#define _BAUDCON1_ABDEN1_POSITION                           0x0
#define _BAUDCON1_ABDEN1_SIZE                               0x1
#define _BAUDCON1_ABDEN1_LENGTH                             0x1
#define _BAUDCON1_ABDEN1_MASK                               0x1
#define _BAUDCON1_WUE1_POSN                                 0x1
#define _BAUDCON1_WUE1_POSITION                             0x1
#define _BAUDCON1_WUE1_SIZE                                 0x1
#define _BAUDCON1_WUE1_LENGTH                               0x1
#define _BAUDCON1_WUE1_MASK                                 0x2
#define _BAUDCON1_BRG161_POSN                               0x3
#define _BAUDCON1_BRG161_POSITION                           0x3
#define _BAUDCON1_BRG161_SIZE                               0x1
#define _BAUDCON1_BRG161_LENGTH                             0x1
#define _BAUDCON1_BRG161_MASK                               0x8
#define _BAUDCON1_SCKP1_POSN                                0x4
#define _BAUDCON1_SCKP1_POSITION                            0x4
#define _BAUDCON1_SCKP1_SIZE                                0x1
#define _BAUDCON1_SCKP1_LENGTH                              0x1
#define _BAUDCON1_SCKP1_MASK                                0x10
#define _BAUDCON1_DTRXP1_POSN                               0x5
#define _BAUDCON1_DTRXP1_POSITION                           0x5
#define _BAUDCON1_DTRXP1_SIZE                               0x1
#define _BAUDCON1_DTRXP1_LENGTH                             0x1
#define _BAUDCON1_DTRXP1_MASK                               0x20
#define _BAUDCON1_RCIDL1_POSN                               0x6
#define _BAUDCON1_RCIDL1_POSITION                           0x6
#define _BAUDCON1_RCIDL1_SIZE                               0x1
#define _BAUDCON1_RCIDL1_LENGTH                             0x1
#define _BAUDCON1_RCIDL1_MASK                               0x40
#define _BAUDCON1_ABDOVF1_POSN                              0x7
#define _BAUDCON1_ABDOVF1_POSITION                          0x7
#define _BAUDCON1_ABDOVF1_SIZE                              0x1
#define _BAUDCON1_ABDOVF1_LENGTH                            0x1
#define _BAUDCON1_ABDOVF1_MASK                              0x80
#define _BAUDCON1_TXCKP1_POSN                               0x4
#define _BAUDCON1_TXCKP1_POSITION                           0x4
#define _BAUDCON1_TXCKP1_SIZE                               0x1
#define _BAUDCON1_TXCKP1_LENGTH                             0x1
#define _BAUDCON1_TXCKP1_MASK                               0x10
#define _BAUDCON1_RXDTP1_POSN                               0x5
#define _BAUDCON1_RXDTP1_POSITION                           0x5
#define _BAUDCON1_RXDTP1_SIZE                               0x1
#define _BAUDCON1_RXDTP1_LENGTH                             0x1
#define _BAUDCON1_RXDTP1_MASK                               0x20
#define _BAUDCON1_RCMT1_POSN                                0x6
#define _BAUDCON1_RCMT1_POSITION                            0x6
#define _BAUDCON1_RCMT1_SIZE                                0x1
#define _BAUDCON1_RCMT1_LENGTH                              0x1
#define _BAUDCON1_RCMT1_MASK                                0x40
#define _BAUDCON1_RXCKP_POSN                                0x5
#define _BAUDCON1_RXCKP_POSITION                            0x5
#define _BAUDCON1_RXCKP_SIZE                                0x1
#define _BAUDCON1_RXCKP_LENGTH                              0x1
#define _BAUDCON1_RXCKP_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned IREN                   :1;
        unsigned BRG16                  :1;
        unsigned TXCKP                  :1;
        unsigned RXDTP                  :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKTXP                  :1;
        unsigned DTRXP                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCMT                   :1;
    };
    struct {
        unsigned ABDEN1                 :1;
        unsigned WUE1                   :1;
        unsigned                        :1;
        unsigned BRG161                 :1;
        unsigned SCKP1                  :1;
        unsigned DTRXP1                 :1;
        unsigned RCIDL1                 :1;
        unsigned ABDOVF1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP1                 :1;
        unsigned RXDTP1                 :1;
        unsigned RCMT1                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXCKP                  :1;
    };
} BAUDCONbits_t;
