MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
extern volatile PIE3bits_t PIE3bits __at(0xFA3);
// bitfield macros
#define _PIE3_RTCCIE_POSN                                   0x0
#define _PIE3_RTCCIE_POSITION                               0x0
#define _PIE3_RTCCIE_SIZE                                   0x1
#define _PIE3_RTCCIE_LENGTH                                 0x1
#define _PIE3_RTCCIE_MASK                                   0x1
#define _PIE3_CCP1IE_POSN                                   0x1
#define _PIE3_CCP1IE_POSITION                               0x1
#define _PIE3_CCP1IE_SIZE                                   0x1
#define _PIE3_CCP1IE_LENGTH                                 0x1
#define _PIE3_CCP1IE_MASK                                   0x2
#define _PIE3_CCP2IE_POSN                                   0x2
#define _PIE3_CCP2IE_POSITION                               0x2
#define _PIE3_CCP2IE_SIZE                                   0x1
#define _PIE3_CCP2IE_LENGTH                                 0x1
#define _PIE3_CCP2IE_MASK                                   0x4
#define _PIE3_CTMUIE_POSN                                   0x3
#define _PIE3_CTMUIE_POSITION                               0x3
#define _PIE3_CTMUIE_SIZE                                   0x1
#define _PIE3_CTMUIE_LENGTH                                 0x1
#define _PIE3_CTMUIE_MASK                                   0x8
#define _PIE3_TX2IE_POSN                                    0x4
#define _PIE3_TX2IE_POSITION                                0x4
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x10
#define _PIE3_RC2IE_POSN                                    0x5
#define _PIE3_RC2IE_POSITION                                0x5
#define _PIE3_RC2IE_SIZE                                    0x1
#define _PIE3_RC2IE_LENGTH                                  0x1
#define _PIE3_RC2IE_MASK                                    0x20
#define _PIE3_LCDIE_POSN                                    0x6
#define _PIE3_LCDIE_POSITION                                0x6
#define _PIE3_LCDIE_SIZE                                    0x1
#define _PIE3_LCDIE_LENGTH                                  0x1
#define _PIE3_LCDIE_MASK                                    0x40
#define _PIE3_TMR5GIE_POSN                                  0x7
#define _PIE3_TMR5GIE_POSITION                              0x7
#define _PIE3_TMR5GIE_SIZE                                  0x1
#define _PIE3_TMR5GIE_LENGTH                                0x1
#define _PIE3_TMR5GIE_MASK                                  0x80
#define _PIE3_RXB0IE_POSN                                   0x0
#define _PIE3_RXB0IE_POSITION                               0x0
#define _PIE3_RXB0IE_SIZE                                   0x1
#define _PIE3_RXB0IE_LENGTH                                 0x1
#define _PIE3_RXB0IE_MASK                                   0x1
#define _PIE3_RXB1IE_POSN                                   0x1
#define _PIE3_RXB1IE_POSITION                               0x1
#define _PIE3_RXB1IE_SIZE                                   0x1
#define _PIE3_RXB1IE_LENGTH                                 0x1
#define _PIE3_RXB1IE_MASK                                   0x2
#define _PIE3_TXB0IE_POSN                                   0x2
#define _PIE3_TXB0IE_POSITION                               0x2
#define _PIE3_TXB0IE_SIZE                                   0x1
#define _PIE3_TXB0IE_LENGTH                                 0x1
#define _PIE3_TXB0IE_MASK                                   0x4
#define _PIE3_TXB1IE_POSN                                   0x3
#define _PIE3_TXB1IE_POSITION                               0x3
#define _PIE3_TXB1IE_SIZE                                   0x1
#define _PIE3_TXB1IE_LENGTH                                 0x1
#define _PIE3_TXB1IE_MASK                                   0x8
#define _PIE3_TXB2IE_POSN                                   0x4
#define _PIE3_TXB2IE_POSITION                               0x4
#define _PIE3_TXB2IE_SIZE                                   0x1
#define _PIE3_TXB2IE_LENGTH                                 0x1
#define _PIE3_TXB2IE_MASK                                   0x10
#define _PIE3_RXBNIE_POSN                                   0x1
#define _PIE3_RXBNIE_POSITION                               0x1
#define _PIE3_RXBNIE_SIZE                                   0x1
#define _PIE3_RXBNIE_LENGTH                                 0x1
#define _PIE3_RXBNIE_MASK                                   0x2
#define _PIE3_TXBNIE_POSN                                   0x4
#define _PIE3_TXBNIE_POSITION                               0x4
#define _PIE3_TXBNIE_SIZE                                   0x1
#define _PIE3_TXBNIE_LENGTH                                 0x1
#define _PIE3_TXBNIE_MASK                                   0x10

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0xFA4);
#ifndef _LIB_BUILD
asm("PIR3 equ 0FA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCCIF                 :1;
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned CTMUIF                 :1;
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
        unsigned LCDIF                  :1;
        unsigned TMR5GIF                :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIF                 :1;
        unsigned                        :2;
        unsigned TXBNIF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0xFA4);
// bitfield macros
#define _PIR3_RTCCIF_POSN                                   0x0
#define _PIR3_RTCCIF_POSITION                               0x0
#define _PIR3_RTCCIF_SIZE                                   0x1
#define _PIR3_RTCCIF_LENGTH                                 0x1
#define _PIR3_RTCCIF_MASK                                   0x1
#define _PIR3_CCP1IF_POSN                                   0x1
#define _PIR3_CCP1IF_POSITION                               0x1
#define _PIR3_CCP1IF_SIZE                                   0x1
#define _PIR3_CCP1IF_LENGTH                                 0x1
#define _PIR3_CCP1IF_MASK                                   0x2
#define _PIR3_CCP2IF_POSN                                   0x2
#define _PIR3_CCP2IF_POSITION                               0x2
#define _PIR3_CCP2IF_SIZE                                   0x1
#define _PIR3_CCP2IF_LENGTH                                 0x1
#define _PIR3_CCP2IF_MASK                                   0x4
#define _PIR3_CTMUIF_POSN                                   0x3
#define _PIR3_CTMUIF_POSITION                               0x3
#define _PIR3_CTMUIF_SIZE                                   0x1
#define _PIR3_CTMUIF_LENGTH                                 0x1
#define _PIR3_CTMUIF_MASK                                   0x8
#define _PIR3_TX2IF_POSN                                    0x4
#define _PIR3_TX2IF_POSITION                                0x4
#define _PIR3_TX2IF_SIZE                                    0x1
#define _PIR3_TX2IF_LENGTH                                  0x1
#define _PIR3_TX2IF_MASK                                    0x10
#define _PIR3_RC2IF_POSN                                    0x5
#define _PIR3_RC2IF_POSITION                                0x5
#define _PIR3_RC2IF_SIZE                                    0x1
#define _PIR3_RC2IF_LENGTH                                  0x1
#define _PIR3_RC2IF_MASK                                    0x20
#define _PIR3_LCDIF_POSN                                    0x6
#define _PIR3_LCDIF_POSITION                                0x6
#define _PIR3_LCDIF_SIZE                                    0x1
#define _PIR3_LCDIF_LENGTH                                  0x1
#define _PIR3_LCDIF_MASK                                    0x40
#define _PIR3_TMR5GIF_POSN                                  0x7
#define _PIR3_TMR5GIF_POSITION                              0x7
#define _PIR3_TMR5GIF_SIZE                                  0x1
#define _PIR3_TMR5GIF_LENGTH                                0x1
#define _PIR3_TMR5GIF_MASK                                  0x80
#define _PIR3_RXBNIF_POSN                                   0x1
#define _PIR3_RXBNIF_POSITION                               0x1
#define _PIR3_RXBNIF_SIZE                                   0x1
#define _PIR3_RXBNIF_LENGTH                                 0x1
#define _PIR3_RXBNIF_MASK                                   0x2
#define _PIR3_TXBNIF_POSN                                   0x4
#define _PIR3_TXBNIF_POSITION                               0x4
#define _PIR3_TXBNIF_SIZE                                   0x1
#define _PIR3_TXBNIF_LENGTH                                 0x1
#define _PIR3_TXBNIF_MASK                                   0x10

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0xFA5);
#ifndef _LIB_BUILD
asm("IPR3 equ 0FA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCCIP                 :1;
        unsigned CCP1IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned CTMUIP                 :1;
        unsigned TX2IP                  :1;
        unsigned RC2IP                  :1;
        unsigned LCDIP                  :1;
        unsigned TMR5GIP                :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIP                 :1;
        unsigned                        :2;
        unsigned TXBNIP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0xFA5);
// bitfield macros
#define _IPR3_RTCCIP_POSN                                   0x0
#define _IPR3_RTCCIP_POSITION                               0x0
#define _IPR3_RTCCIP_SIZE                                   0x1
#define _IPR3_RTCCIP_LENGTH                                 0x1
#define _IPR3_RTCCIP_MASK                                   0x1
#define _IPR3_CCP1IP_POSN                                   0x1
#define _IPR3_CCP1IP_POSITION                               0x1
#define _IPR3_CCP1IP_SIZE                                   0x1
#define _IPR3_CCP1IP_LENGTH                                 0x1
#define _IPR3_CCP1IP_MASK                                   0x2
#define _IPR3_CCP2IP_POSN                                   0x2
#define _IPR3_CCP2IP_POSITION                               0x2
#define _IPR3_CCP2IP_SIZE                                   0x1
#define _IPR3_CCP2IP_LENGTH                                 0x1
#define _IPR3_CCP2IP_MASK                                   0x4
#define _IPR3_CTMUIP_POSN                                   0x3
#define _IPR3_CTMUIP_POSITION                               0x3
#define _IPR3_CTMUIP_SIZE                                   0x1
#define _IPR3_CTMUIP_LENGTH                                 0x1
#define _IPR3_CTMUIP_MASK                                   0x8
#define _IPR3_TX2IP_POSN                                    0x4
#define _IPR3_TX2IP_POSITION                                0x4
#define _IPR3_TX2IP_SIZE                                    0x1
#define _IPR3_TX2IP_LENGTH                                  0x1
#define _IPR3_TX2IP_MASK                                    0x10
#define _IPR3_RC2IP_POSN                                    0x5
#define _IPR3_RC2IP_POSITION                                0x5
#define _IPR3_RC2IP_SIZE                                    0x1
#define _IPR3_RC2IP_LENGTH                                  0x1
#define _IPR3_RC2IP_MASK                                    0x20
#define _IPR3_LCDIP_POSN                                    0x6
#define _IPR3_LCDIP_POSITION                                0x6
#define _IPR3_LCDIP_SIZE                                    0x1
#define _IPR3_LCDIP_LENGTH                                  0x1
#define _IPR3_LCDIP_MASK                                    0x40
#define _IPR3_TMR5GIP_POSN                                  0x7
#define _IPR3_TMR5GIP_POSITION                              0x7
#define _IPR3_TMR5GIP_SIZE                                  0x1
#define _IPR3_TMR5GIP_LENGTH                                0x1
#define _IPR3_TMR5GIP_MASK                                  0x80
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0xFA6);
#ifndef _LIB_BUILD
asm("PIR6 equ 0FA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1IF                 :1;
        unsigned CMP2IF                 :1;
        unsigned CMP3IF                 :1;
        unsigned                        :1;
        unsigned TX3IF                  :1;
        unsigned RC3IF                  :1;
        unsigned TX4IF                  :1;
        unsigned RC4IF                  :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0xFA6);
// bitfield macros
#define _PIR6_CMP1IF_POSN                                   0x0
#define _PIR6_CMP1IF_POSITION                               0x0
#define _PIR6_CMP1IF_SIZE                                   0x1
#define _PIR6_CMP1IF_LENGTH                                 0x1
#define _PIR6_CMP1IF_MASK                                   0x1
#define _PIR6_CMP2IF_POSN                                   0x1
#define _PIR6_CMP2IF_POSITION                               0x1
#define _PIR6_CMP2IF_SIZE                                   0x1
#define _PIR6_CMP2IF_LENGTH                                 0x1
#define _PIR6_CMP2IF_MASK                                   0x2
#define _PIR6_CMP3IF_POSN                                   0x2
#define _PIR6_CMP3IF_POSITION                               0x2
#define _PIR6_CMP3IF_SIZE                                   0x1
#define _PIR6_CMP3IF_LENGTH                                 0x1
#define _PIR6_CMP3IF_MASK                                   0x4
#define _PIR6_TX3IF_POSN                                    0x4
#define _PIR6_TX3IF_POSITION                                0x4
#define _PIR6_TX3IF_SIZE                                    0x1
#define _PIR6_TX3IF_LENGTH                                  0x1
#define _PIR6_TX3IF_MASK                                    0x10
#define _PIR6_RC3IF_POSN                                    0x5
#define _PIR6_RC3IF_POSITION                                0x5
#define _PIR6_RC3IF_SIZE                                    0x1
#define _PIR6_RC3IF_LENGTH                                  0x1
#define _PIR6_RC3IF_MASK                                    0x20
#define _PIR6_TX4IF_POSN                                    0x6
#define _PIR6_TX4IF_POSITION                                0x6
#define _PIR6_TX4IF_SIZE                                    0x1
#define _PIR6_TX4IF_LENGTH                                  0x1
#define _PIR6_TX4IF_MASK                                    0x40
#define _PIR6_RC4IF_POSN                                    0x7
#define _PIR6_RC4IF_POSITION                                0x7
#define _PIR6_RC4IF_SIZE                                    0x1
#define _PIR6_RC4IF_LENGTH                                  0x1
#define _PIR6_RC4IF_MASK                                    0x80

// Register: PSPCON
#define PSPCON PSPCON
extern volatile unsigned char           PSPCON              __at(0xFA7);
#ifndef _LIB_BUILD
asm("PSPCON equ 0FA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PSPMODE                :1;
        unsigned IBOV                   :1;
        unsigned OBF                    :1;
        unsigned IBF                    :1;
    };
} PSPCONbits_t;
extern volatile PSPCONbits_t PSPCONbits __at(0xFA7);
// bitfield macros
#define _PSPCON_PSPMODE_POSN                                0x4
#define _PSPCON_PSPMODE_POSITION                            0x4
#define _PSPCON_PSPMODE_SIZE                                0x1
#define _PSPCON_PSPMODE_LENGTH                              0x1
#define _PSPCON_PSPMODE_MASK                                0x10
#define _PSPCON_IBOV_POSN                                   0x5
#define _PSPCON_IBOV_POSITION                               0x5
#define _PSPCON_IBOV_SIZE                                   0x1
#define _PSPCON_IBOV_LENGTH                                 0x1
#define _PSPCON_IBOV_MASK                                   0x20
#define _PSPCON_OBF_POSN                                    0x6
#define _PSPCON_OBF_POSITION                                0x6
#define _PSPCON_OBF_SIZE                                    0x1
#define _PSPCON_OBF_LENGTH                                  0x1
#define _PSPCON_OBF_MASK                                    0x40
#define _PSPCON_IBF_POSN                                    0x7
#define _PSPCON_IBF_POSITION                                0x7
#define _PSPCON_IBF_SIZE                                    0x1
#define _PSPCON_IBF_LENGTH                                  0x1
#define _PSPCON_IBF_MASK                                    0x80

// Register: HLVDCON
#define HLVDCON HLVDCON
extern volatile unsigned char           HLVDCON             __at(0xFA8);
#ifndef _LIB_BUILD
asm("HLVDCON equ 0FA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLVDL                  :4;
        unsigned HLVDEN                 :1;
        unsigned IRVST                  :1;
        unsigned BGVST                  :1;
        unsigned VDIRMAG                :1;
    };
    struct {
        unsigned HLVDL0                 :1;
        unsigned HLVDL1                 :1;
        unsigned HLVDL2                 :1;
        unsigned HLVDL3                 :1;
    };
} HLVDCONbits_t;
