MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
#define                                 ECCP3IF_bit         _BIT_ACCESS(PIR4,0)
// IPR4<ECCP3IP>
extern volatile __bit                   ECCP3IP             __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 ECCP3IP_bit         _BIT_ACCESS(IPR4,0)
// PMD0<ECCP3MD>
extern volatile __bit                   ECCP3MD             __at(0x77A0);	// @ (0xEF4 * 8 + 0)
#define                                 ECCP3MD_bit         _BIT_ACCESS(PMD0,0)
// ODCON2<ECCP3OD>
extern volatile __bit                   ECCP3OD             __at(0x7750);	// @ (0xEEA * 8 + 0)
#define                                 ECCP3OD_bit         _BIT_ACCESS(ODCON2,0)
// RPINR16_17<ECCP3R0>
extern volatile __bit                   ECCP3R0             __at(0x7194);	// @ (0xE32 * 8 + 4)
#define                                 ECCP3R0_bit         _BIT_ACCESS(RPINR16_17,4)
// RPINR16_17<ECCP3R1>
extern volatile __bit                   ECCP3R1             __at(0x7195);	// @ (0xE32 * 8 + 5)
#define                                 ECCP3R1_bit         _BIT_ACCESS(RPINR16_17,5)
// RPINR16_17<ECCP3R2>
extern volatile __bit                   ECCP3R2             __at(0x7196);	// @ (0xE32 * 8 + 6)
#define                                 ECCP3R2_bit         _BIT_ACCESS(RPINR16_17,6)
// RPINR16_17<ECCP3R3>
extern volatile __bit                   ECCP3R3             __at(0x7197);	// @ (0xE32 * 8 + 7)
#define                                 ECCP3R3_bit         _BIT_ACCESS(RPINR16_17,7)
// CTMUCON4<EDG1EN>
extern volatile __bit                   EDG1EN              __at(0x77AF);	// @ (0xEF5 * 8 + 7)
#define                                 EDG1EN_bit          _BIT_ACCESS(CTMUCON4,7)
// CTMUCON4<EDG1POL>
extern volatile __bit                   EDG1POL             __at(0x77AE);	// @ (0xEF5 * 8 + 6)
#define                                 EDG1POL_bit         _BIT_ACCESS(CTMUCON4,6)
// CTMUCON4<EDG1SEL0>
extern volatile __bit                   EDG1SEL0            __at(0x77AA);	// @ (0xEF5 * 8 + 2)
#define                                 EDG1SEL0_bit        _BIT_ACCESS(CTMUCON4,2)
// CTMUCON4<EDG1SEL1>
extern volatile __bit                   EDG1SEL1            __at(0x77AB);	// @ (0xEF5 * 8 + 3)
#define                                 EDG1SEL1_bit        _BIT_ACCESS(CTMUCON4,3)
// CTMUCON4<EDG1SEL2>
extern volatile __bit                   EDG1SEL2            __at(0x77AC);	// @ (0xEF5 * 8 + 4)
#define                                 EDG1SEL2_bit        _BIT_ACCESS(CTMUCON4,4)
// CTMUCON4<EDG1SEL3>
extern volatile __bit                   EDG1SEL3            __at(0x77AD);	// @ (0xEF5 * 8 + 5)
#define                                 EDG1SEL3_bit        _BIT_ACCESS(CTMUCON4,5)
// CTMUCON4<EDG1STAT>
extern volatile __bit                   EDG1STAT            __at(0x77A8);	// @ (0xEF5 * 8 + 0)
#define                                 EDG1STAT_bit        _BIT_ACCESS(CTMUCON4,0)
// CTMUCON3<EDG2EN>
extern volatile __bit                   EDG2EN              __at(0x77B7);	// @ (0xEF6 * 8 + 7)
#define                                 EDG2EN_bit          _BIT_ACCESS(CTMUCON3,7)
// CTMUCON3<EDG2POL>
extern volatile __bit                   EDG2POL             __at(0x77B6);	// @ (0xEF6 * 8 + 6)
#define                                 EDG2POL_bit         _BIT_ACCESS(CTMUCON3,6)
// CTMUCON3<EDG2SEL0>
extern volatile __bit                   EDG2SEL0            __at(0x77B2);	// @ (0xEF6 * 8 + 2)
#define                                 EDG2SEL0_bit        _BIT_ACCESS(CTMUCON3,2)
// CTMUCON3<EDG2SEL1>
extern volatile __bit                   EDG2SEL1            __at(0x77B3);	// @ (0xEF6 * 8 + 3)
#define                                 EDG2SEL1_bit        _BIT_ACCESS(CTMUCON3,3)
// CTMUCON3<EDG2SEL2>
extern volatile __bit                   EDG2SEL2            __at(0x77B4);	// @ (0xEF6 * 8 + 4)
#define                                 EDG2SEL2_bit        _BIT_ACCESS(CTMUCON3,4)
// CTMUCON3<EDG2SEL3>
extern volatile __bit                   EDG2SEL3            __at(0x77B5);	// @ (0xEF6 * 8 + 5)
#define                                 EDG2SEL3_bit        _BIT_ACCESS(CTMUCON3,5)
// CTMUCON4<EDG2STAT>
extern volatile __bit                   EDG2STAT            __at(0x77A9);	// @ (0xEF5 * 8 + 1)
#define                                 EDG2STAT_bit        _BIT_ACCESS(CTMUCON4,1)
// CTMUCON1<EDGEN>
extern volatile __bit                   EDGEN               __at(0x77C3);	// @ (0xEF8 * 8 + 3)
#define                                 EDGEN_bit           _BIT_ACCESS(CTMUCON1,3)
// CTMUCON1<EDGSEQEN>
extern volatile __bit                   EDGSEQEN            __at(0x77C2);	// @ (0xEF8 * 8 + 2)
#define                                 EDGSEQEN_bit        _BIT_ACCESS(CTMUCON1,2)
// USTAT<ENDP0>
extern volatile __bit                   ENDP0               __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 ENDP0_bit           _BIT_ACCESS(USTAT,3)
// USTAT<ENDP1>
extern volatile __bit                   ENDP1               __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 ENDP1_bit           _BIT_ACCESS(USTAT,4)
// USTAT<ENDP2>
extern volatile __bit                   ENDP2               __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 ENDP2_bit           _BIT_ACCESS(USTAT,5)
// USTAT<ENDP3>
extern volatile __bit                   ENDP3               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 ENDP3_bit           _BIT_ACCESS(USTAT,6)
// UEP0<EP0CONDIS>
extern volatile __bit                   EP0CONDIS           __at(0x6FFB);	// @ (0xDFF * 8 + 3)
#define                                 EP0CONDIS_bit       _BIT_ACCESS(UEP0,3)
// UEP0<EP0HSHK>
extern volatile __bit                   EP0HSHK             __at(0x6FFC);	// @ (0xDFF * 8 + 4)
#define                                 EP0HSHK_bit         _BIT_ACCESS(UEP0,4)
// UEP0<EP0INEN>
extern volatile __bit                   EP0INEN             __at(0x6FF9);	// @ (0xDFF * 8 + 1)
#define                                 EP0INEN_bit         _BIT_ACCESS(UEP0,1)
// UEP0<EP0OUTEN>
extern volatile __bit                   EP0OUTEN            __at(0x6FFA);	// @ (0xDFF * 8 + 2)
#define                                 EP0OUTEN_bit        _BIT_ACCESS(UEP0,2)
// UEP0<EP0STALL>
extern volatile __bit                   EP0STALL            __at(0x6FF8);	// @ (0xDFF * 8 + 0)
#define                                 EP0STALL_bit        _BIT_ACCESS(UEP0,0)
// UEP1<EP1CONDIS>
extern volatile __bit                   EP1CONDIS           __at(0x7003);	// @ (0xE00 * 8 + 3)
#define                                 EP1CONDIS_bit       _BIT_ACCESS(UEP1,3)
// UEP1<EP1HSHK>
extern volatile __bit                   EP1HSHK             __at(0x7004);	// @ (0xE00 * 8 + 4)
#define                                 EP1HSHK_bit         _BIT_ACCESS(UEP1,4)
// UEP1<EP1INEN>
extern volatile __bit                   EP1INEN             __at(0x7001);	// @ (0xE00 * 8 + 1)
#define                                 EP1INEN_bit         _BIT_ACCESS(UEP1,1)
// UEP1<EP1OUTEN>
extern volatile __bit                   EP1OUTEN            __at(0x7002);	// @ (0xE00 * 8 + 2)
#define                                 EP1OUTEN_bit        _BIT_ACCESS(UEP1,2)
// UEP1<EP1STALL>
extern volatile __bit                   EP1STALL            __at(0x7000);	// @ (0xE00 * 8 + 0)
#define                                 EP1STALL_bit        _BIT_ACCESS(UEP1,0)
// UEP2<EP2CONDIS>
extern volatile __bit                   EP2CONDIS           __at(0x700B);	// @ (0xE01 * 8 + 3)
#define                                 EP2CONDIS_bit       _BIT_ACCESS(UEP2,3)
// UEP2<EP2HSHK>
extern volatile __bit                   EP2HSHK             __at(0x700C);	// @ (0xE01 * 8 + 4)
#define                                 EP2HSHK_bit         _BIT_ACCESS(UEP2,4)
// UEP2<EP2INEN>
extern volatile __bit                   EP2INEN             __at(0x7009);	// @ (0xE01 * 8 + 1)
#define                                 EP2INEN_bit         _BIT_ACCESS(UEP2,1)
// UEP2<EP2OUTEN>
extern volatile __bit                   EP2OUTEN            __at(0x700A);	// @ (0xE01 * 8 + 2)
#define                                 EP2OUTEN_bit        _BIT_ACCESS(UEP2,2)
// UEP2<EP2STALL>
extern volatile __bit                   EP2STALL            __at(0x7008);	// @ (0xE01 * 8 + 0)
#define                                 EP2STALL_bit        _BIT_ACCESS(UEP2,0)
// UEP3<EP3CONDIS>
extern volatile __bit                   EP3CONDIS           __at(0x7013);	// @ (0xE02 * 8 + 3)
#define                                 EP3CONDIS_bit       _BIT_ACCESS(UEP3,3)
// UEP3<EP3HSHK>
extern volatile __bit                   EP3HSHK             __at(0x7014);	// @ (0xE02 * 8 + 4)
#define                                 EP3HSHK_bit         _BIT_ACCESS(UEP3,4)
// UEP3<EP3INEN>
extern volatile __bit                   EP3INEN             __at(0x7011);	// @ (0xE02 * 8 + 1)
#define                                 EP3INEN_bit         _BIT_ACCESS(UEP3,1)
// UEP3<EP3OUTEN>
extern volatile __bit                   EP3OUTEN            __at(0x7012);	// @ (0xE02 * 8 + 2)
#define                                 EP3OUTEN_bit        _BIT_ACCESS(UEP3,2)
// UEP3<EP3STALL>
extern volatile __bit                   EP3STALL            __at(0x7010);	// @ (0xE02 * 8 + 0)
#define                                 EP3STALL_bit        _BIT_ACCESS(UEP3,0)
// UEP4<EP4CONDIS>
extern volatile __bit                   EP4CONDIS           __at(0x701B);	// @ (0xE03 * 8 + 3)
#define                                 EP4CONDIS_bit       _BIT_ACCESS(UEP4,3)
// UEP4<EP4HSHK>
extern volatile __bit                   EP4HSHK             __at(0x701C);	// @ (0xE03 * 8 + 4)
#define                                 EP4HSHK_bit         _BIT_ACCESS(UEP4,4)
// UEP4<EP4INEN>
extern volatile __bit                   EP4INEN             __at(0x7019);	// @ (0xE03 * 8 + 1)
#define                                 EP4INEN_bit         _BIT_ACCESS(UEP4,1)
// UEP4<EP4OUTEN>
extern volatile __bit                   EP4OUTEN            __at(0x701A);	// @ (0xE03 * 8 + 2)
#define                                 EP4OUTEN_bit        _BIT_ACCESS(UEP4,2)
// UEP4<EP4STALL>
extern volatile __bit                   EP4STALL            __at(0x7018);	// @ (0xE03 * 8 + 0)
#define                                 EP4STALL_bit        _BIT_ACCESS(UEP4,0)
// UEP5<EP5CONDIS>
extern volatile __bit                   EP5CONDIS           __at(0x7023);	// @ (0xE04 * 8 + 3)
#define                                 EP5CONDIS_bit       _BIT_ACCESS(UEP5,3)
// UEP5<EP5HSHK>
extern volatile __bit                   EP5HSHK             __at(0x7024);	// @ (0xE04 * 8 + 4)
#define                                 EP5HSHK_bit         _BIT_ACCESS(UEP5,4)
// UEP5<EP5INEN>
extern volatile __bit                   EP5INEN             __at(0x7021);	// @ (0xE04 * 8 + 1)
#define                                 EP5INEN_bit         _BIT_ACCESS(UEP5,1)
// UEP5<EP5OUTEN>
extern volatile __bit                   EP5OUTEN            __at(0x7022);	// @ (0xE04 * 8 + 2)
#define                                 EP5OUTEN_bit        _BIT_ACCESS(UEP5,2)
// UEP5<EP5STALL>
extern volatile __bit                   EP5STALL            __at(0x7020);	// @ (0xE04 * 8 + 0)
#define                                 EP5STALL_bit        _BIT_ACCESS(UEP5,0)
// UEP6<EP6CONDIS>
extern volatile __bit                   EP6CONDIS           __at(0x702B);	// @ (0xE05 * 8 + 3)
#define                                 EP6CONDIS_bit       _BIT_ACCESS(UEP6,3)
// UEP6<EP6HSHK>
extern volatile __bit                   EP6HSHK             __at(0x702C);	// @ (0xE05 * 8 + 4)
#define                                 EP6HSHK_bit         _BIT_ACCESS(UEP6,4)
// UEP6<EP6INEN>
extern volatile __bit                   EP6INEN             __at(0x7029);	// @ (0xE05 * 8 + 1)
#define                                 EP6INEN_bit         _BIT_ACCESS(UEP6,1)
// UEP6<EP6OUTEN>
extern volatile __bit                   EP6OUTEN            __at(0x702A);	// @ (0xE05 * 8 + 2)
#define                                 EP6OUTEN_bit        _BIT_ACCESS(UEP6,2)
// UEP6<EP6STALL>
extern volatile __bit                   EP6STALL            __at(0x7028);	// @ (0xE05 * 8 + 0)
#define                                 EP6STALL_bit        _BIT_ACCESS(UEP6,0)
// UEP7<EP7CONDIS>
extern volatile __bit                   EP7CONDIS           __at(0x7033);	// @ (0xE06 * 8 + 3)
#define                                 EP7CONDIS_bit       _BIT_ACCESS(UEP7,3)
// UEP7<EP7HSHK>
extern volatile __bit                   EP7HSHK             __at(0x7034);	// @ (0xE06 * 8 + 4)
#define                                 EP7HSHK_bit         _BIT_ACCESS(UEP7,4)
// UEP7<EP7INEN>
extern volatile __bit                   EP7INEN             __at(0x7031);	// @ (0xE06 * 8 + 1)
#define                                 EP7INEN_bit         _BIT_ACCESS(UEP7,1)
// UEP7<EP7OUTEN>
extern volatile __bit                   EP7OUTEN            __at(0x7032);	// @ (0xE06 * 8 + 2)
#define                                 EP7OUTEN_bit        _BIT_ACCESS(UEP7,2)
// UEP7<EP7STALL>
extern volatile __bit                   EP7STALL            __at(0x7030);	// @ (0xE06 * 8 + 0)
#define                                 EP7STALL_bit        _BIT_ACCESS(UEP7,0)
// UEP0<EPCONDIS0>
extern volatile __bit                   EPCONDIS0           __at(0x6FFB);	// @ (0xDFF * 8 + 3)
#define                                 EPCONDIS0_bit       _BIT_ACCESS(UEP0,3)
// UEP1<EPCONDIS1>
extern volatile __bit                   EPCONDIS1           __at(0x7003);	// @ (0xE00 * 8 + 3)
#define                                 EPCONDIS1_bit       _BIT_ACCESS(UEP1,3)
// UEP10<EPCONDIS10>
extern volatile __bit                   EPCONDIS10          __at(0x704B);	// @ (0xE09 * 8 + 3)
#define                                 EPCONDIS10_bit      _BIT_ACCESS(UEP10,3)
// UEP11<EPCONDIS11>
extern volatile __bit                   EPCONDIS11          __at(0x7053);	// @ (0xE0A * 8 + 3)
#define                                 EPCONDIS11_bit      _BIT_ACCESS(UEP11,3)
// UEP12<EPCONDIS12>
extern volatile __bit                   EPCONDIS12          __at(0x705B);	// @ (0xE0B * 8 + 3)
#define                                 EPCONDIS12_bit      _BIT_ACCESS(UEP12,3)
// UEP13<EPCONDIS13>
extern volatile __bit                   EPCONDIS13          __at(0x7063);	// @ (0xE0C * 8 + 3)
#define                                 EPCONDIS13_bit      _BIT_ACCESS(UEP13,3)
// UEP14<EPCONDIS14>
extern volatile __bit                   EPCONDIS14          __at(0x706B);	// @ (0xE0D * 8 + 3)
#define                                 EPCONDIS14_bit      _BIT_ACCESS(UEP14,3)
// UEP15<EPCONDIS15>
extern volatile __bit                   EPCONDIS15          __at(0x7073);	// @ (0xE0E * 8 + 3)
#define                                 EPCONDIS15_bit      _BIT_ACCESS(UEP15,3)
// UEP2<EPCONDIS2>
extern volatile __bit                   EPCONDIS2           __at(0x700B);	// @ (0xE01 * 8 + 3)
#define                                 EPCONDIS2_bit       _BIT_ACCESS(UEP2,3)
// UEP3<EPCONDIS3>
extern volatile __bit                   EPCONDIS3           __at(0x7013);	// @ (0xE02 * 8 + 3)
#define                                 EPCONDIS3_bit       _BIT_ACCESS(UEP3,3)
// UEP4<EPCONDIS4>
extern volatile __bit                   EPCONDIS4           __at(0x701B);	// @ (0xE03 * 8 + 3)
#define                                 EPCONDIS4_bit       _BIT_ACCESS(UEP4,3)
// UEP5<EPCONDIS5>
extern volatile __bit                   EPCONDIS5           __at(0x7023);	// @ (0xE04 * 8 + 3)
#define                                 EPCONDIS5_bit       _BIT_ACCESS(UEP5,3)
// UEP6<EPCONDIS6>
extern volatile __bit                   EPCONDIS6           __at(0x702B);	// @ (0xE05 * 8 + 3)
#define                                 EPCONDIS6_bit       _BIT_ACCESS(UEP6,3)
// UEP7<EPCONDIS7>
extern volatile __bit                   EPCONDIS7           __at(0x7033);	// @ (0xE06 * 8 + 3)
#define                                 EPCONDIS7_bit       _BIT_ACCESS(UEP7,3)
// UEP8<EPCONDIS8>
extern volatile __bit                   EPCONDIS8           __at(0x703B);	// @ (0xE07 * 8 + 3)
#define                                 EPCONDIS8_bit       _BIT_ACCESS(UEP8,3)
// UEP9<EPCONDIS9>
extern volatile __bit                   EPCONDIS9           __at(0x7043);	// @ (0xE08 * 8 + 3)
#define                                 EPCONDIS9_bit       _BIT_ACCESS(UEP9,3)
// UEP0<EPHSHK0>
extern volatile __bit                   EPHSHK0             __at(0x6FFC);	// @ (0xDFF * 8 + 4)
#define                                 EPHSHK0_bit         _BIT_ACCESS(UEP0,4)
// UEP1<EPHSHK1>
extern volatile __bit                   EPHSHK1             __at(0x7004);	// @ (0xE00 * 8 + 4)
#define                                 EPHSHK1_bit         _BIT_ACCESS(UEP1,4)
// UEP10<EPHSHK10>
extern volatile __bit                   EPHSHK10            __at(0x704C);	// @ (0xE09 * 8 + 4)
#define                                 EPHSHK10_bit        _BIT_ACCESS(UEP10,4)
// UEP11<EPHSHK11>
extern volatile __bit                   EPHSHK11            __at(0x7054);	// @ (0xE0A * 8 + 4)
#define                                 EPHSHK11_bit        _BIT_ACCESS(UEP11,4)
// UEP12<EPHSHK12>
extern volatile __bit                   EPHSHK12            __at(0x705C);	// @ (0xE0B * 8 + 4)
#define                                 EPHSHK12_bit        _BIT_ACCESS(UEP12,4)
// UEP13<EPHSHK13>
extern volatile __bit                   EPHSHK13            __at(0x7064);	// @ (0xE0C * 8 + 4)
#define                                 EPHSHK13_bit        _BIT_ACCESS(UEP13,4)
// UEP14<EPHSHK14>
extern volatile __bit                   EPHSHK14            __at(0x706C);	// @ (0xE0D * 8 + 4)
#define                                 EPHSHK14_bit        _BIT_ACCESS(UEP14,4)
// UEP15<EPHSHK15>
extern volatile __bit                   EPHSHK15            __at(0x7074);	// @ (0xE0E * 8 + 4)
#define                                 EPHSHK15_bit        _BIT_ACCESS(UEP15,4)
// UEP2<EPHSHK2>
extern volatile __bit                   EPHSHK2             __at(0x700C);	// @ (0xE01 * 8 + 4)
#define                                 EPHSHK2_bit         _BIT_ACCESS(UEP2,4)
// UEP3<EPHSHK3>
extern volatile __bit                   EPHSHK3             __at(0x7014);	// @ (0xE02 * 8 + 4)
#define                                 EPHSHK3_bit         _BIT_ACCESS(UEP3,4)
// UEP4<EPHSHK4>
extern volatile __bit                   EPHSHK4             __at(0x701C);	// @ (0xE03 * 8 + 4)
#define                                 EPHSHK4_bit         _BIT_ACCESS(UEP4,4)
// UEP5<EPHSHK5>
extern volatile __bit                   EPHSHK5             __at(0x7024);	// @ (0xE04 * 8 + 4)
#define                                 EPHSHK5_bit         _BIT_ACCESS(UEP5,4)
// UEP6<EPHSHK6>
extern volatile __bit                   EPHSHK6             __at(0x702C);	// @ (0xE05 * 8 + 4)
#define                                 EPHSHK6_bit         _BIT_ACCESS(UEP6,4)
// UEP7<EPHSHK7>
extern volatile __bit                   EPHSHK7             __at(0x7034);	// @ (0xE06 * 8 + 4)
#define                                 EPHSHK7_bit         _BIT_ACCESS(UEP7,4)
// UEP8<EPHSHK8>
extern volatile __bit                   EPHSHK8             __at(0x703C);	// @ (0xE07 * 8 + 4)
#define                                 EPHSHK8_bit         _BIT_ACCESS(UEP8,4)
// UEP9<EPHSHK9>
extern volatile __bit                   EPHSHK9             __at(0x7044);	// @ (0xE08 * 8 + 4)
#define                                 EPHSHK9_bit         _BIT_ACCESS(UEP9,4)
// UEP0<EPINEN0>
extern volatile __bit                   EPINEN0             __at(0x6FF9);	// @ (0xDFF * 8 + 1)
#define                                 EPINEN0_bit         _BIT_ACCESS(UEP0,1)
// UEP1<EPINEN1>
extern volatile __bit                   EPINEN1             __at(0x7001);	// @ (0xE00 * 8 + 1)
#define                                 EPINEN1_bit         _BIT_ACCESS(UEP1,1)
// UEP10<EPINEN10>
extern volatile __bit                   EPINEN10            __at(0x7049);	// @ (0xE09 * 8 + 1)
#define                                 EPINEN10_bit        _BIT_ACCESS(UEP10,1)
// UEP11<EPINEN11>
extern volatile __bit                   EPINEN11            __at(0x7051);	// @ (0xE0A * 8 + 1)
#define                                 EPINEN11_bit        _BIT_ACCESS(UEP11,1)
// UEP12<EPINEN12>
extern volatile __bit                   EPINEN12            __at(0x7059);	// @ (0xE0B * 8 + 1)
#define                                 EPINEN12_bit        _BIT_ACCESS(UEP12,1)
// UEP13<EPINEN13>
extern volatile __bit                   EPINEN13            __at(0x7061);	// @ (0xE0C * 8 + 1)
#define                                 EPINEN13_bit        _BIT_ACCESS(UEP13,1)
// UEP14<EPINEN14>
extern volatile __bit                   EPINEN14            __at(0x7069);	// @ (0xE0D * 8 + 1)
#define                                 EPINEN14_bit        _BIT_ACCESS(UEP14,1)
// UEP15<EPINEN15>
extern volatile __bit                   EPINEN15            __at(0x7071);	// @ (0xE0E * 8 + 1)
#define                                 EPINEN15_bit        _BIT_ACCESS(UEP15,1)
// UEP2<EPINEN2>
extern volatile __bit                   EPINEN2             __at(0x7009);	// @ (0xE01 * 8 + 1)
#define                                 EPINEN2_bit         _BIT_ACCESS(UEP2,1)
// UEP3<EPINEN3>
extern volatile __bit                   EPINEN3             __at(0x7011);	// @ (0xE02 * 8 + 1)
#define                                 EPINEN3_bit         _BIT_ACCESS(UEP3,1)
// UEP4<EPINEN4>
extern volatile __bit                   EPINEN4             __at(0x7019);	// @ (0xE03 * 8 + 1)
#define                                 EPINEN4_bit         _BIT_ACCESS(UEP4,1)
// UEP5<EPINEN5>
extern volatile __bit                   EPINEN5             __at(0x7021);	// @ (0xE04 * 8 + 1)
#define                                 EPINEN5_bit         _BIT_ACCESS(UEP5,1)
// UEP6<EPINEN6>
extern volatile __bit                   EPINEN6             __at(0x7029);	// @ (0xE05 * 8 + 1)
#define                                 EPINEN6_bit         _BIT_ACCESS(UEP6,1)
// UEP7<EPINEN7>
extern volatile __bit                   EPINEN7             __at(0x7031);	// @ (0xE06 * 8 + 1)
#define                                 EPINEN7_bit         _BIT_ACCESS(UEP7,1)
// UEP8<EPINEN8>
extern volatile __bit                   EPINEN8             __at(0x7039);	// @ (0xE07 * 8 + 1)
#define                                 EPINEN8_bit         _BIT_ACCESS(UEP8,1)
// UEP9<EPINEN9>
extern volatile __bit                   EPINEN9             __at(0x7041);	// @ (0xE08 * 8 + 1)
#define                                 EPINEN9_bit         _BIT_ACCESS(UEP9,1)
// UEP0<EPOUTEN0>
extern volatile __bit                   EPOUTEN0            __at(0x6FFA);	// @ (0xDFF * 8 + 2)
#define                                 EPOUTEN0_bit        _BIT_ACCESS(UEP0,2)
// UEP1<EPOUTEN1>
extern volatile __bit                   EPOUTEN1            __at(0x7002);	// @ (0xE00 * 8 + 2)
#define                                 EPOUTEN1_bit        _BIT_ACCESS(UEP1,2)
// UEP10<EPOUTEN10>
extern volatile __bit                   EPOUTEN10           __at(0x704A);	// @ (0xE09 * 8 + 2)
#define                                 EPOUTEN10_bit       _BIT_ACCESS(UEP10,2)
// UEP11<EPOUTEN11>
extern volatile __bit                   EPOUTEN11           __at(0x7052);	// @ (0xE0A * 8 + 2)
#define                                 EPOUTEN11_bit       _BIT_ACCESS(UEP11,2)
// UEP12<EPOUTEN12>
extern volatile __bit                   EPOUTEN12           __at(0x705A);	// @ (0xE0B * 8 + 2)
#define                                 EPOUTEN12_bit       _BIT_ACCESS(UEP12,2)
// UEP13<EPOUTEN13>
extern volatile __bit                   EPOUTEN13           __at(0x7062);	// @ (0xE0C * 8 + 2)
#define                                 EPOUTEN13_bit       _BIT_ACCESS(UEP13,2)
// UEP14<EPOUTEN14>
extern volatile __bit                   EPOUTEN14           __at(0x706A);	// @ (0xE0D * 8 + 2)
#define                                 EPOUTEN14_bit       _BIT_ACCESS(UEP14,2)
// UEP15<EPOUTEN15>
extern volatile __bit                   EPOUTEN15           __at(0x7072);	// @ (0xE0E * 8 + 2)
