MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
extern volatile __bit                   LATF4               __at(0x7C74);	// @ (0xF8E * 8 + 4)
#define                                 LATF4_bit           _BIT_ACCESS(LATF,4)
// LATF<LATF5>
extern volatile __bit                   LATF5               __at(0x7C75);	// @ (0xF8E * 8 + 5)
#define                                 LATF5_bit           _BIT_ACCESS(LATF,5)
// LATF<LATF6>
extern volatile __bit                   LATF6               __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 LATF6_bit           _BIT_ACCESS(LATF,6)
// LATF<LATF7>
extern volatile __bit                   LATF7               __at(0x7C77);	// @ (0xF8E * 8 + 7)
#define                                 LATF7_bit           _BIT_ACCESS(LATF,7)
// LATG<LATG0>
extern volatile __bit                   LATG0               __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 LATG0_bit           _BIT_ACCESS(LATG,0)
// LATG<LATG1>
extern volatile __bit                   LATG1               __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 LATG1_bit           _BIT_ACCESS(LATG,1)
// LATG<LATG2>
extern volatile __bit                   LATG2               __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 LATG2_bit           _BIT_ACCESS(LATG,2)
// LATG<LATG3>
extern volatile __bit                   LATG3               __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 LATG3_bit           _BIT_ACCESS(LATG,3)
// LATG<LATG4>
extern volatile __bit                   LATG4               __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 LATG4_bit           _BIT_ACCESS(LATG,4)
// LATG<LATG6>
extern volatile __bit                   LATG6               __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 LATG6_bit           _BIT_ACCESS(LATG,6)
// LATG<LATG7>
extern volatile __bit                   LATG7               __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 LATG7_bit           _BIT_ACCESS(LATG,7)
// LATH<LATH0>
extern volatile __bit                   LATH0               __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 LATH0_bit           _BIT_ACCESS(LATH,0)
// LATH<LATH1>
extern volatile __bit                   LATH1               __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 LATH1_bit           _BIT_ACCESS(LATH,1)
// LATH<LATH2>
extern volatile __bit                   LATH2               __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 LATH2_bit           _BIT_ACCESS(LATH,2)
// LATH<LATH3>
extern volatile __bit                   LATH3               __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 LATH3_bit           _BIT_ACCESS(LATH,3)
// LATH<LATH4>
extern volatile __bit                   LATH4               __at(0x7C84);	// @ (0xF90 * 8 + 4)
#define                                 LATH4_bit           _BIT_ACCESS(LATH,4)
// LATH<LATH5>
extern volatile __bit                   LATH5               __at(0x7C85);	// @ (0xF90 * 8 + 5)
#define                                 LATH5_bit           _BIT_ACCESS(LATH,5)
// LATH<LATH6>
extern volatile __bit                   LATH6               __at(0x7C86);	// @ (0xF90 * 8 + 6)
#define                                 LATH6_bit           _BIT_ACCESS(LATH,6)
// LATH<LATH7>
extern volatile __bit                   LATH7               __at(0x7C87);	// @ (0xF90 * 8 + 7)
#define                                 LATH7_bit           _BIT_ACCESS(LATH,7)
// LATJ<LATJ0>
extern volatile __bit                   LATJ0               __at(0x7C88);	// @ (0xF91 * 8 + 0)
#define                                 LATJ0_bit           _BIT_ACCESS(LATJ,0)
// LATJ<LATJ1>
extern volatile __bit                   LATJ1               __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 LATJ1_bit           _BIT_ACCESS(LATJ,1)
// LATJ<LATJ2>
extern volatile __bit                   LATJ2               __at(0x7C8A);	// @ (0xF91 * 8 + 2)
#define                                 LATJ2_bit           _BIT_ACCESS(LATJ,2)
// LATJ<LATJ3>
extern volatile __bit                   LATJ3               __at(0x7C8B);	// @ (0xF91 * 8 + 3)
#define                                 LATJ3_bit           _BIT_ACCESS(LATJ,3)
// LATJ<LATJ4>
extern volatile __bit                   LATJ4               __at(0x7C8C);	// @ (0xF91 * 8 + 4)
#define                                 LATJ4_bit           _BIT_ACCESS(LATJ,4)
// LATJ<LATJ5>
extern volatile __bit                   LATJ5               __at(0x7C8D);	// @ (0xF91 * 8 + 5)
#define                                 LATJ5_bit           _BIT_ACCESS(LATJ,5)
// LATJ<LATJ6>
extern volatile __bit                   LATJ6               __at(0x7C8E);	// @ (0xF91 * 8 + 6)
#define                                 LATJ6_bit           _BIT_ACCESS(LATJ,6)
// LATJ<LATJ7>
extern volatile __bit                   LATJ7               __at(0x7C8F);	// @ (0xF91 * 8 + 7)
#define                                 LATJ7_bit           _BIT_ACCESS(LATJ,7)
// LATK<LATK0>
extern volatile __bit                   LATK0               __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 LATK0_bit           _BIT_ACCESS(LATK,0)
// LATK<LATK1>
extern volatile __bit                   LATK1               __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 LATK1_bit           _BIT_ACCESS(LATK,1)
// LATK<LATK2>
extern volatile __bit                   LATK2               __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 LATK2_bit           _BIT_ACCESS(LATK,2)
// LATK<LATK3>
extern volatile __bit                   LATK3               __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 LATK3_bit           _BIT_ACCESS(LATK,3)
// LATK<LATK4>
extern volatile __bit                   LATK4               __at(0x7744);	// @ (0xEE8 * 8 + 4)
#define                                 LATK4_bit           _BIT_ACCESS(LATK,4)
// LATK<LATK5>
extern volatile __bit                   LATK5               __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 LATK5_bit           _BIT_ACCESS(LATK,5)
// LATK<LATK6>
extern volatile __bit                   LATK6               __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 LATK6_bit           _BIT_ACCESS(LATK,6)
// LATK<LATK7>
extern volatile __bit                   LATK7               __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 LATK7_bit           _BIT_ACCESS(LATK,7)
// LATL<LATL0>
extern volatile __bit                   LATL0               __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 LATL0_bit           _BIT_ACCESS(LATL,0)
// LATL<LATL1>
extern volatile __bit                   LATL1               __at(0x7729);	// @ (0xEE5 * 8 + 1)
#define                                 LATL1_bit           _BIT_ACCESS(LATL,1)
// LATL<LATL2>
extern volatile __bit                   LATL2               __at(0x772A);	// @ (0xEE5 * 8 + 2)
#define                                 LATL2_bit           _BIT_ACCESS(LATL,2)
// LATL<LATL3>
extern volatile __bit                   LATL3               __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 LATL3_bit           _BIT_ACCESS(LATL,3)
// LATL<LATL4>
extern volatile __bit                   LATL4               __at(0x772C);	// @ (0xEE5 * 8 + 4)
#define                                 LATL4_bit           _BIT_ACCESS(LATL,4)
// LATL<LATL5>
extern volatile __bit                   LATL5               __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 LATL5_bit           _BIT_ACCESS(LATL,5)
// LATL<LATL6>
extern volatile __bit                   LATL6               __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 LATL6_bit           _BIT_ACCESS(LATL,6)
// LATL<LATL7>
extern volatile __bit                   LATL7               __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 LATL7_bit           _BIT_ACCESS(LATL,7)
// LATVP<LATVP0>
extern volatile __bit                   LATVP0              __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 LATVP0_bit          _BIT_ACCESS(LATVP,0)
// LATVP<LATVP1>
extern volatile __bit                   LATVP1              __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 LATVP1_bit          _BIT_ACCESS(LATVP,1)
// LATVP<LATVP2>
extern volatile __bit                   LATVP2              __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 LATVP2_bit          _BIT_ACCESS(LATVP,2)
// LATVP<LATVP3>
extern volatile __bit                   LATVP3              __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 LATVP3_bit          _BIT_ACCESS(LATVP,3)
// LATVP<LATVP4>
extern volatile __bit                   LATVP4              __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 LATVP4_bit          _BIT_ACCESS(LATVP,4)
// LATVP<LATVP5>
extern volatile __bit                   LATVP5              __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 LATVP5_bit          _BIT_ACCESS(LATVP,5)
// LATVP<LATVP6>
extern volatile __bit                   LATVP6              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 LATVP6_bit          _BIT_ACCESS(LATVP,6)
// LATVP<LATVP7>
extern volatile __bit                   LATVP7              __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 LATVP7_bit          _BIT_ACCESS(LATVP,7)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LB3_bit             _BIT_ACCESS(LATB,3)
// LATB<LB4>
extern volatile __bit                   LB4                 __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LB4_bit             _BIT_ACCESS(LATB,4)
// LATB<LB5>
extern volatile __bit                   LB5                 __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LB5_bit             _BIT_ACCESS(LATB,5)
// LATB<LB6>
extern volatile __bit                   LB6                 __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 LB6_bit             _BIT_ACCESS(LATB,6)
// LATB<LB7>
extern volatile __bit                   LB7                 __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 LB7_bit             _BIT_ACCESS(LATB,7)
// LATC<LC0>
extern volatile __bit                   LC0                 __at(0x7C58);	// @ (0xF8B * 8 + 0)
#define                                 LC0_bit             _BIT_ACCESS(LATC,0)
// LATC<LC1>
extern volatile __bit                   LC1                 __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 LC1_bit             _BIT_ACCESS(LATC,1)
// LATC<LC2>
extern volatile __bit                   LC2                 __at(0x7C5A);	// @ (0xF8B * 8 + 2)
#define                                 LC2_bit             _BIT_ACCESS(LATC,2)
// LATC<LC3>
extern volatile __bit                   LC3                 __at(0x7C5B);	// @ (0xF8B * 8 + 3)
#define                                 LC3_bit             _BIT_ACCESS(LATC,3)
// LATC<LC4>
extern volatile __bit                   LC4                 __at(0x7C5C);	// @ (0xF8B * 8 + 4)
#define                                 LC4_bit             _BIT_ACCESS(LATC,4)
// LATC<LC5>
extern volatile __bit                   LC5                 __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LC5_bit             _BIT_ACCESS(LATC,5)
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LC6_bit             _BIT_ACCESS(LATC,6)
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LC7_bit             _BIT_ACCESS(LATC,7)
// LCDPS<LCDA>
extern volatile __bit                   LCDA                __at(0x76D5);	// @ (0xEDA * 8 + 5)
#define                                 LCDA_bit            _BIT_ACCESS(LCDPS,5)
// LCDREF<LCDCST0>
extern volatile __bit                   LCDCST0             __at(0x76BB);	// @ (0xED7 * 8 + 3)
#define                                 LCDCST0_bit         _BIT_ACCESS(LCDREF,3)
// LCDREF<LCDCST1>
extern volatile __bit                   LCDCST1             __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 LCDCST1_bit         _BIT_ACCESS(LCDREF,4)
// LCDREF<LCDCST2>
extern volatile __bit                   LCDCST2             __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 LCDCST2_bit         _BIT_ACCESS(LCDREF,5)
// LCDCON<LCDEN>
extern volatile __bit                   LCDEN               __at(0x76CF);	// @ (0xED9 * 8 + 7)
#define                                 LCDEN_bit           _BIT_ACCESS(LCDCON,7)
// PIE3<LCDIE>
extern volatile __bit                   LCDIE               __at(0x7D1E);	// @ (0xFA3 * 8 + 6)
#define                                 LCDIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<LCDIF>
extern volatile __bit                   LCDIF               __at(0x7D26);	// @ (0xFA4 * 8 + 6)
#define                                 LCDIF_bit           _BIT_ACCESS(PIR3,6)
// IPR3<LCDIP>
extern volatile __bit                   LCDIP               __at(0x7D2E);	// @ (0xFA5 * 8 + 6)
#define                                 LCDIP_bit           _BIT_ACCESS(IPR3,6)
// LCDREF<LCDIRE>
extern volatile __bit                   LCDIRE              __at(0x76BF);	// @ (0xED7 * 8 + 7)
#define                                 LCDIRE_bit          _BIT_ACCESS(LCDREF,7)
// PMD3<LCDMD>
extern volatile __bit                   LCDMD               __at(0x778B);	// @ (0xEF1 * 8 + 3)
#define                                 LCDMD_bit           _BIT_ACCESS(PMD3,3)
// LATD<LD0>
extern volatile __bit                   LD0                 __at(0x7C60);	// @ (0xF8C * 8 + 0)
#define                                 LD0_bit             _BIT_ACCESS(LATD,0)
// LATD<LD1>
extern volatile __bit                   LD1                 __at(0x7C61);	// @ (0xF8C * 8 + 1)
#define                                 LD1_bit             _BIT_ACCESS(LATD,1)
// LATD<LD2>
extern volatile __bit                   LD2                 __at(0x7C62);	// @ (0xF8C * 8 + 2)
#define                                 LD2_bit             _BIT_ACCESS(LATD,2)
// LATD<LD3>
extern volatile __bit                   LD3                 __at(0x7C63);	// @ (0xF8C * 8 + 3)
#define                                 LD3_bit             _BIT_ACCESS(LATD,3)
// LATD<LD4>
extern volatile __bit                   LD4                 __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LD4_bit             _BIT_ACCESS(LATD,4)
// LATD<LD5>
extern volatile __bit                   LD5                 __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LD5_bit             _BIT_ACCESS(LATD,5)
// LATD<LD6>
extern volatile __bit                   LD6                 __at(0x7C66);	// @ (0xF8C * 8 + 6)
#define                                 LD6_bit             _BIT_ACCESS(LATD,6)
// LATD<LD7>
extern volatile __bit                   LD7                 __at(0x7C67);	// @ (0xF8C * 8 + 7)
#define                                 LD7_bit             _BIT_ACCESS(LATD,7)
// LATE<LE0>
extern volatile __bit                   LE0                 __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 LE0_bit             _BIT_ACCESS(LATE,0)
// LATE<LE1>
extern volatile __bit                   LE1                 __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 LE1_bit             _BIT_ACCESS(LATE,1)
// LATE<LE2>
extern volatile __bit                   LE2                 __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 LE2_bit             _BIT_ACCESS(LATE,2)
// LATE<LE3>
extern volatile __bit                   LE3                 __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 LE3_bit             _BIT_ACCESS(LATE,3)
// LATE<LE4>
extern volatile __bit                   LE4                 __at(0x7C6C);	// @ (0xF8D * 8 + 4)
#define                                 LE4_bit             _BIT_ACCESS(LATE,4)
// LATE<LE5>
extern volatile __bit                   LE5                 __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 LE5_bit             _BIT_ACCESS(LATE,5)
// LATE<LE6>
extern volatile __bit                   LE6                 __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 LE6_bit             _BIT_ACCESS(LATE,6)
// LATE<LE7>
extern volatile __bit                   LE7                 __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 LE7_bit             _BIT_ACCESS(LATE,7)
// LATF<LF2>
extern volatile __bit                   LF2                 __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 LF2_bit             _BIT_ACCESS(LATF,2)
// LATF<LF3>
extern volatile __bit                   LF3                 __at(0x7C73);	// @ (0xF8E * 8 + 3)
#define                                 LF3_bit             _BIT_ACCESS(LATF,3)
// LATF<LF4>
extern volatile __bit                   LF4                 __at(0x7C74);	// @ (0xF8E * 8 + 4)
#define                                 LF4_bit             _BIT_ACCESS(LATF,4)
// LATF<LF5>
extern volatile __bit                   LF5                 __at(0x7C75);	// @ (0xF8E * 8 + 5)
#define                                 LF5_bit             _BIT_ACCESS(LATF,5)
// LATF<LF6>
extern volatile __bit                   LF6                 __at(0x7C76);	// @ (0xF8E * 8 + 6)
#define                                 LF6_bit             _BIT_ACCESS(LATF,6)
// LATF<LF7>
extern volatile __bit                   LF7                 __at(0x7C77);	// @ (0xF8E * 8 + 7)
#define                                 LF7_bit             _BIT_ACCESS(LATF,7)
// LATG<LG0>
extern volatile __bit                   LG0                 __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 LG0_bit             _BIT_ACCESS(LATG,0)
// LATG<LG1>
extern volatile __bit                   LG1                 __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 LG1_bit             _BIT_ACCESS(LATG,1)
// LATG<LG2>
extern volatile __bit                   LG2                 __at(0x7C7A);	// @ (0xF8F * 8 + 2)
#define                                 LG2_bit             _BIT_ACCESS(LATG,2)
// LATG<LG3>
extern volatile __bit                   LG3                 __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 LG3_bit             _BIT_ACCESS(LATG,3)
// LATG<LG4>
extern volatile __bit                   LG4                 __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 LG4_bit             _BIT_ACCESS(LATG,4)
// LATG<LG6>
extern volatile __bit                   LG6                 __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 LG6_bit             _BIT_ACCESS(LATG,6)
// LATG<LG7>
extern volatile __bit                   LG7                 __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 LG7_bit             _BIT_ACCESS(LATG,7)
// LATH<LH0>
extern volatile __bit                   LH0                 __at(0x7C80);	// @ (0xF90 * 8 + 0)
#define                                 LH0_bit             _BIT_ACCESS(LATH,0)
// LATH<LH1>
extern volatile __bit                   LH1                 __at(0x7C81);	// @ (0xF90 * 8 + 1)
#define                                 LH1_bit             _BIT_ACCESS(LATH,1)
// LATH<LH2>
extern volatile __bit                   LH2                 __at(0x7C82);	// @ (0xF90 * 8 + 2)
#define                                 LH2_bit             _BIT_ACCESS(LATH,2)
// LATH<LH3>
extern volatile __bit                   LH3                 __at(0x7C83);	// @ (0xF90 * 8 + 3)
#define                                 LH3_bit             _BIT_ACCESS(LATH,3)
// LATH<LH4>
extern volatile __bit                   LH4                 __at(0x7C84);	// @ (0xF90 * 8 + 4)
#define                                 LH4_bit             _BIT_ACCESS(LATH,4)
// LATH<LH5>
extern volatile __bit                   LH5                 __at(0x7C85);	// @ (0xF90 * 8 + 5)
#define                                 LH5_bit             _BIT_ACCESS(LATH,5)
// LATH<LH6>
extern volatile __bit                   LH6                 __at(0x7C86);	// @ (0xF90 * 8 + 6)
#define                                 LH6_bit             _BIT_ACCESS(LATH,6)
// LATH<LH7>
extern volatile __bit                   LH7                 __at(0x7C87);	// @ (0xF90 * 8 + 7)
#define                                 LH7_bit             _BIT_ACCESS(LATH,7)
// LATJ<LJ0>
extern volatile __bit                   LJ0                 __at(0x7C88);	// @ (0xF91 * 8 + 0)
#define                                 LJ0_bit             _BIT_ACCESS(LATJ,0)
// LATJ<LJ1>
extern volatile __bit                   LJ1                 __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 LJ1_bit             _BIT_ACCESS(LATJ,1)
// LATJ<LJ2>
extern volatile __bit                   LJ2                 __at(0x7C8A);	// @ (0xF91 * 8 + 2)
#define                                 LJ2_bit             _BIT_ACCESS(LATJ,2)
// LATJ<LJ3>
extern volatile __bit                   LJ3                 __at(0x7C8B);	// @ (0xF91 * 8 + 3)
#define                                 LJ3_bit             _BIT_ACCESS(LATJ,3)
// LATJ<LJ4>
extern volatile __bit                   LJ4                 __at(0x7C8C);	// @ (0xF91 * 8 + 4)
#define                                 LJ4_bit             _BIT_ACCESS(LATJ,4)
// LATJ<LJ5>
extern volatile __bit                   LJ5                 __at(0x7C8D);	// @ (0xF91 * 8 + 5)
#define                                 LJ5_bit             _BIT_ACCESS(LATJ,5)
// LATJ<LJ6>
extern volatile __bit                   LJ6                 __at(0x7C8E);	// @ (0xF91 * 8 + 6)
#define                                 LJ6_bit             _BIT_ACCESS(LATJ,6)
// LATJ<LJ7>
extern volatile __bit                   LJ7                 __at(0x7C8F);	// @ (0xF91 * 8 + 7)
#define                                 LJ7_bit             _BIT_ACCESS(LATJ,7)
// LATK<LK0>
extern volatile __bit                   LK0                 __at(0x7740);	// @ (0xEE8 * 8 + 0)
#define                                 LK0_bit             _BIT_ACCESS(LATK,0)
// LATK<LK1>
extern volatile __bit                   LK1                 __at(0x7741);	// @ (0xEE8 * 8 + 1)
#define                                 LK1_bit             _BIT_ACCESS(LATK,1)
// LATK<LK2>
extern volatile __bit                   LK2                 __at(0x7742);	// @ (0xEE8 * 8 + 2)
#define                                 LK2_bit             _BIT_ACCESS(LATK,2)
// LATK<LK3>
extern volatile __bit                   LK3                 __at(0x7743);	// @ (0xEE8 * 8 + 3)
#define                                 LK3_bit             _BIT_ACCESS(LATK,3)
// LATK<LK4>
extern volatile __bit                   LK4                 __at(0x7744);	// @ (0xEE8 * 8 + 4)
