MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
#define                                 LK4_bit             _BIT_ACCESS(LATK,4)
// LATK<LK5>
extern volatile __bit                   LK5                 __at(0x7745);	// @ (0xEE8 * 8 + 5)
#define                                 LK5_bit             _BIT_ACCESS(LATK,5)
// LATK<LK6>
extern volatile __bit                   LK6                 __at(0x7746);	// @ (0xEE8 * 8 + 6)
#define                                 LK6_bit             _BIT_ACCESS(LATK,6)
// LATK<LK7>
extern volatile __bit                   LK7                 __at(0x7747);	// @ (0xEE8 * 8 + 7)
#define                                 LK7_bit             _BIT_ACCESS(LATK,7)
// LATL<LL0>
extern volatile __bit                   LL0                 __at(0x7728);	// @ (0xEE5 * 8 + 0)
#define                                 LL0_bit             _BIT_ACCESS(LATL,0)
// LATL<LL1>
extern volatile __bit                   LL1                 __at(0x7729);	// @ (0xEE5 * 8 + 1)
#define                                 LL1_bit             _BIT_ACCESS(LATL,1)
// LATL<LL2>
extern volatile __bit                   LL2                 __at(0x772A);	// @ (0xEE5 * 8 + 2)
#define                                 LL2_bit             _BIT_ACCESS(LATL,2)
// LATL<LL3>
extern volatile __bit                   LL3                 __at(0x772B);	// @ (0xEE5 * 8 + 3)
#define                                 LL3_bit             _BIT_ACCESS(LATL,3)
// LATL<LL4>
extern volatile __bit                   LL4                 __at(0x772C);	// @ (0xEE5 * 8 + 4)
#define                                 LL4_bit             _BIT_ACCESS(LATL,4)
// LATL<LL5>
extern volatile __bit                   LL5                 __at(0x772D);	// @ (0xEE5 * 8 + 5)
#define                                 LL5_bit             _BIT_ACCESS(LATL,5)
// LATL<LL6>
extern volatile __bit                   LL6                 __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 LL6_bit             _BIT_ACCESS(LATL,6)
// LATL<LL7>
extern volatile __bit                   LL7                 __at(0x772F);	// @ (0xEE5 * 8 + 7)
#define                                 LL7_bit             _BIT_ACCESS(LATL,7)
// LCDCON<LMUX0>
extern volatile __bit                   LMUX0               __at(0x76C8);	// @ (0xED9 * 8 + 0)
#define                                 LMUX0_bit           _BIT_ACCESS(LCDCON,0)
// LCDCON<LMUX1>
extern volatile __bit                   LMUX1               __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 LMUX1_bit           _BIT_ACCESS(LCDCON,1)
// LCDCON<LMUX2>
extern volatile __bit                   LMUX2               __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 LMUX2_bit           _BIT_ACCESS(LCDCON,2)
// OSCCON2<LOCK>
extern volatile __bit                   LOCK                __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 LOCK_bit            _BIT_ACCESS(OSCCON2,5)
// LCDPS<LP0>
extern volatile __bit                   LP0                 __at(0x76D0);	// @ (0xEDA * 8 + 0)
#define                                 LP0_bit             _BIT_ACCESS(LCDPS,0)
// LCDPS<LP1>
extern volatile __bit                   LP1                 __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 LP1_bit             _BIT_ACCESS(LCDPS,1)
// LCDPS<LP2>
extern volatile __bit                   LP2                 __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 LP2_bit             _BIT_ACCESS(LCDPS,2)
// LCDPS<LP3>
extern volatile __bit                   LP3                 __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 LP3_bit             _BIT_ACCESS(LCDPS,3)
// ADCON5H<LPENA>
extern volatile __bit                   LPENA               __at(0x744E);	// @ (0xE89 * 8 + 6)
#define                                 LPENA_bit           _BIT_ACCESS(ADCON5H,6)
// LCDRL<LRLAP0>
extern volatile __bit                   LRLAP0              __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 LRLAP0_bit          _BIT_ACCESS(LCDRL,6)
// LCDRL<LRLAP1>
extern volatile __bit                   LRLAP1              __at(0x76B7);	// @ (0xED6 * 8 + 7)
#define                                 LRLAP1_bit          _BIT_ACCESS(LCDRL,7)
// LCDRL<LRLAT0>
extern volatile __bit                   LRLAT0              __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 LRLAT0_bit          _BIT_ACCESS(LCDRL,0)
// LCDRL<LRLAT1>
extern volatile __bit                   LRLAT1              __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 LRLAT1_bit          _BIT_ACCESS(LCDRL,1)
// LCDRL<LRLAT2>
extern volatile __bit                   LRLAT2              __at(0x76B2);	// @ (0xED6 * 8 + 2)
#define                                 LRLAT2_bit          _BIT_ACCESS(LCDRL,2)
// LCDRL<LRLBP0>
extern volatile __bit                   LRLBP0              __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 LRLBP0_bit          _BIT_ACCESS(LCDRL,4)
// LCDRL<LRLBP1>
extern volatile __bit                   LRLBP1              __at(0x76B5);	// @ (0xED6 * 8 + 5)
#define                                 LRLBP1_bit          _BIT_ACCESS(LCDRL,5)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 LVDIN_bit           _BIT_ACCESS(PORTA,5)
// PMD4<LVDMD>
extern volatile __bit                   LVDMD               __at(0x7782);	// @ (0xEF0 * 8 + 2)
#define                                 LVDMD_bit           _BIT_ACCESS(PMD4,2)
// MDCON<MDBIT>
extern volatile __bit                   MDBIT               __at(0x7778);	// @ (0xEEF * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON,0)
// MDCARH<MDCH0>
extern volatile __bit                   MDCH0               __at(0x7768);	// @ (0xEED * 8 + 0)
#define                                 MDCH0_bit           _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCH1>
extern volatile __bit                   MDCH1               __at(0x7769);	// @ (0xEED * 8 + 1)
#define                                 MDCH1_bit           _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCH2>
extern volatile __bit                   MDCH2               __at(0x776A);	// @ (0xEED * 8 + 2)
#define                                 MDCH2_bit           _BIT_ACCESS(MDCARH,2)
// MDCARH<MDCH3>
extern volatile __bit                   MDCH3               __at(0x776B);	// @ (0xEED * 8 + 3)
#define                                 MDCH3_bit           _BIT_ACCESS(MDCARH,3)
// MDCARH<MDCHODIS>
extern volatile __bit                   MDCHODIS            __at(0x776F);	// @ (0xEED * 8 + 7)
#define                                 MDCHODIS_bit        _BIT_ACCESS(MDCARH,7)
// MDCARH<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x776E);	// @ (0xEED * 8 + 6)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCARH,6)
// MDCARH<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x776D);	// @ (0xEED * 8 + 5)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCARH,5)
// RPINR30_31<MDCIN1R0>
extern volatile __bit                   MDCIN1R0            __at(0x71C8);	// @ (0xE39 * 8 + 0)
#define                                 MDCIN1R0_bit        _BIT_ACCESS(RPINR30_31,0)
// RPINR30_31<MDCIN1R1>
extern volatile __bit                   MDCIN1R1            __at(0x71C9);	// @ (0xE39 * 8 + 1)
#define                                 MDCIN1R1_bit        _BIT_ACCESS(RPINR30_31,1)
// RPINR30_31<MDCIN1R2>
extern volatile __bit                   MDCIN1R2            __at(0x71CA);	// @ (0xE39 * 8 + 2)
#define                                 MDCIN1R2_bit        _BIT_ACCESS(RPINR30_31,2)
// RPINR30_31<MDCIN1R3>
extern volatile __bit                   MDCIN1R3            __at(0x71CB);	// @ (0xE39 * 8 + 3)
#define                                 MDCIN1R3_bit        _BIT_ACCESS(RPINR30_31,3)
// RPINR30_31<MDCIN2R0>
extern volatile __bit                   MDCIN2R0            __at(0x71CC);	// @ (0xE39 * 8 + 4)
#define                                 MDCIN2R0_bit        _BIT_ACCESS(RPINR30_31,4)
// RPINR30_31<MDCIN2R1>
extern volatile __bit                   MDCIN2R1            __at(0x71CD);	// @ (0xE39 * 8 + 5)
#define                                 MDCIN2R1_bit        _BIT_ACCESS(RPINR30_31,5)
// RPINR30_31<MDCIN2R2>
extern volatile __bit                   MDCIN2R2            __at(0x71CE);	// @ (0xE39 * 8 + 6)
#define                                 MDCIN2R2_bit        _BIT_ACCESS(RPINR30_31,6)
// RPINR30_31<MDCIN2R3>
extern volatile __bit                   MDCIN2R3            __at(0x71CF);	// @ (0xE39 * 8 + 7)
#define                                 MDCIN2R3_bit        _BIT_ACCESS(RPINR30_31,7)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x7760);	// @ (0xEEC * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x7761);	// @ (0xEEC * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x7762);	// @ (0xEEC * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x7763);	// @ (0xEEC * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCARL<MDCLODIS>
extern volatile __bit                   MDCLODIS            __at(0x7767);	// @ (0xEEC * 8 + 7)
#define                                 MDCLODIS_bit        _BIT_ACCESS(MDCARL,7)
// MDCARL<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x7766);	// @ (0xEEC * 8 + 6)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCARL,6)
// MDCARL<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x7765);	// @ (0xEEC * 8 + 5)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCARL,5)
// MDCON<MDEN>
extern volatile __bit                   MDEN                __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON,7)
// RPINR28_29<MDMINR0>
extern volatile __bit                   MDMINR0             __at(0x71C4);	// @ (0xE38 * 8 + 4)
#define                                 MDMINR0_bit         _BIT_ACCESS(RPINR28_29,4)
// RPINR28_29<MDMINR1>
extern volatile __bit                   MDMINR1             __at(0x71C5);	// @ (0xE38 * 8 + 5)
#define                                 MDMINR1_bit         _BIT_ACCESS(RPINR28_29,5)
// RPINR28_29<MDMINR2>
extern volatile __bit                   MDMINR2             __at(0x71C6);	// @ (0xE38 * 8 + 6)
#define                                 MDMINR2_bit         _BIT_ACCESS(RPINR28_29,6)
// RPINR28_29<MDMINR3>
extern volatile __bit                   MDMINR3             __at(0x71C7);	// @ (0xE38 * 8 + 7)
#define                                 MDMINR3_bit         _BIT_ACCESS(RPINR28_29,7)
// MDCON<MDO>
extern volatile __bit                   MDO                 __at(0x777B);	// @ (0xEEF * 8 + 3)
#define                                 MDO_bit             _BIT_ACCESS(MDCON,3)
// MDCON<MDOE>
extern volatile __bit                   MDOE                __at(0x777E);	// @ (0xEEF * 8 + 6)
#define                                 MDOE_bit            _BIT_ACCESS(MDCON,6)
// MDCON<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x777C);	// @ (0xEEF * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON,4)
// MDCON<MDSLR>
extern volatile __bit                   MDSLR               __at(0x777D);	// @ (0xEEF * 8 + 5)
#define                                 MDSLR_bit           _BIT_ACCESS(MDCON,5)
// MDSRC<MDSODIS>
extern volatile __bit                   MDSODIS             __at(0x7777);	// @ (0xEEE * 8 + 7)
#define                                 MDSODIS_bit         _BIT_ACCESS(MDSRC,7)
// MDSRC<MDSRC0>
extern volatile __bit                   MDSRC0              __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 MDSRC0_bit          _BIT_ACCESS(MDSRC,0)
// MDSRC<MDSRC1>
extern volatile __bit                   MDSRC1              __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 MDSRC1_bit          _BIT_ACCESS(MDSRC,1)
// MDSRC<MDSRC2>
extern volatile __bit                   MDSRC2              __at(0x7772);	// @ (0xEEE * 8 + 2)
#define                                 MDSRC2_bit          _BIT_ACCESS(MDSRC,2)
// MDSRC<MDSRC3>
extern volatile __bit                   MDSRC3              __at(0x7773);	// @ (0xEEE * 8 + 3)
#define                                 MDSRC3_bit          _BIT_ACCESS(MDSRC,3)
// ADCON1H<MODE12>
extern volatile __bit                   MODE12              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 MODE12_bit          _BIT_ACCESS(ADCON1H,2)
// LCDREG<MODE13>
extern volatile __bit                   MODE13              __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 MODE13_bit          _BIT_ACCESS(LCDREG,2)
// PMD3<MODMD>
extern volatile __bit                   MODMD               __at(0x778F);	// @ (0xEF1 * 8 + 7)
#define                                 MODMD_bit           _BIT_ACCESS(PMD3,7)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0x7810);	// @ (0xF02 * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0x7811);	// @ (0xF02 * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0x7812);	// @ (0xF02 * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0x7814);	// @ (0xF02 * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 MSK62_bit           _BIT_ACCESS(SSP2ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// SSP2ADD<MSK72>
extern volatile __bit                   MSK72               __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 MSK72_bit           _BIT_ACCESS(SSP2ADD,7)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON<NOSC0>
extern volatile __bit                   NOSC0               __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON,0)
// OSCCON<NOSC1>
extern volatile __bit                   NOSC1               __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON,1)
// OSCCON<NOSC2>
extern volatile __bit                   NOSC2               __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON,2)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_ADDRESS2>
extern volatile __bit                   NOT_ADDRESS2        __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 NOT_ADDRESS2_bit    _BIT_ACCESS(SSP2STAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// RCON<NOT_CM>
extern volatile __bit                   NOT_CM              __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 NOT_CM_bit          _BIT_ACCESS(RCON,5)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// SSP1STAT<NOT_WRITE1>
extern volatile __bit                   NOT_WRITE1          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE1_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_WRITE2>
extern volatile __bit                   NOT_WRITE2          __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 NOT_WRITE2_bit      _BIT_ACCESS(SSP2STAT,2)
// ADCON2H<NVCFG0>
extern volatile __bit                   NVCFG0              __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 NVCFG0_bit          _BIT_ACCESS(ADCON2H,5)
// PSPCON<OBF>
extern volatile __bit                   OBF                 __at(0x7D3E);	// @ (0xFA7 * 8 + 6)
#define                                 OBF_bit             _BIT_ACCESS(PSPCON,6)
// ADCON2H<OFFCAL>
extern volatile __bit                   OFFCAL              __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 OFFCAL_bit          _BIT_ACCESS(ADCON2H,4)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// PSTR1CON<P1DC02>
extern volatile __bit                   P1DC02              __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC02_bit          _BIT_ACCESS(PSTR1CON,0)
// PSTR1CON<P1DC0CON>
extern volatile __bit                   P1DC0CON            __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC0CON_bit        _BIT_ACCESS(PSTR1CON,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// PSTR1CON<P1DC12>
extern volatile __bit                   P1DC12              __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC12_bit          _BIT_ACCESS(PSTR1CON,1)
// PSTR1CON<P1DC1CON>
extern volatile __bit                   P1DC1CON            __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC1CON_bit        _BIT_ACCESS(PSTR1CON,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// PSTR1CON<P1DC22>
