MikroElektronika/core_packages/PIC/XC8/def/PIC18F95J94/mcu.h
#define                                 REFO2MD_bit         _BIT_ACCESS(PMD3,0)
// DSCONL<RELEASE>
extern volatile __bit                   RELEASE             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 RELEASE_bit         _BIT_ACCESS(DSCONL,0)
// PADCFG1<REPU>
extern volatile __bit                   REPU                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PADCFG1,6)
// UCON<RESUME>
extern volatile __bit                   RESUME              __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 RESUME_bit          _BIT_ACCESS(UCON,2)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// PADCFG1<RFPU>
extern volatile __bit                   RFPU                __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 RFPU_bit            _BIT_ACCESS(PADCFG1,5)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// PORTG<RG6>
extern volatile __bit                   RG6                 __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 RG6_bit             _BIT_ACCESS(PORTG,6)
// PORTG<RG7>
extern volatile __bit                   RG7                 __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 RG7_bit             _BIT_ACCESS(PORTG,7)
// PADCFG1<RGPU>
extern volatile __bit                   RGPU                __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 RGPU_bit            _BIT_ACCESS(PADCFG1,4)
// PORTH<RH0>
extern volatile __bit                   RH0                 __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 RH0_bit             _BIT_ACCESS(PORTH,0)
// PORTH<RH1>
extern volatile __bit                   RH1                 __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 RH1_bit             _BIT_ACCESS(PORTH,1)
// PORTH<RH2>
extern volatile __bit                   RH2                 __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 RH2_bit             _BIT_ACCESS(PORTH,2)
// PORTH<RH3>
extern volatile __bit                   RH3                 __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 RH3_bit             _BIT_ACCESS(PORTH,3)
// PORTH<RH4>
extern volatile __bit                   RH4                 __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 RH4_bit             _BIT_ACCESS(PORTH,4)
// PORTH<RH5>
extern volatile __bit                   RH5                 __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 RH5_bit             _BIT_ACCESS(PORTH,5)
// PORTH<RH6>
extern volatile __bit                   RH6                 __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 RH6_bit             _BIT_ACCESS(PORTH,6)
// PORTH<RH7>
extern volatile __bit                   RH7                 __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 RH7_bit             _BIT_ACCESS(PORTH,7)
// PADCFG1<RHPU>
extern volatile __bit                   RHPU                __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 RHPU_bit            _BIT_ACCESS(PADCFG1,3)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTJ<RJ0>
extern volatile __bit                   RJ0                 __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 RJ0_bit             _BIT_ACCESS(PORTJ,0)
// PORTJ<RJ1>
extern volatile __bit                   RJ1                 __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 RJ1_bit             _BIT_ACCESS(PORTJ,1)
// PORTJ<RJ2>
extern volatile __bit                   RJ2                 __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 RJ2_bit             _BIT_ACCESS(PORTJ,2)
// PORTJ<RJ3>
extern volatile __bit                   RJ3                 __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 RJ3_bit             _BIT_ACCESS(PORTJ,3)
// PORTJ<RJ4>
extern volatile __bit                   RJ4                 __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 RJ4_bit             _BIT_ACCESS(PORTJ,4)
// PORTJ<RJ5>
extern volatile __bit                   RJ5                 __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 RJ5_bit             _BIT_ACCESS(PORTJ,5)
// PORTJ<RJ6>
extern volatile __bit                   RJ6                 __at(0x7C46);	// @ (0xF88 * 8 + 6)
#define                                 RJ6_bit             _BIT_ACCESS(PORTJ,6)
// PORTJ<RJ7>
extern volatile __bit                   RJ7                 __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 RJ7_bit             _BIT_ACCESS(PORTJ,7)
// PORTK<RK0>
extern volatile __bit                   RK0                 __at(0x7738);	// @ (0xEE7 * 8 + 0)
#define                                 RK0_bit             _BIT_ACCESS(PORTK,0)
// PORTK<RK1>
extern volatile __bit                   RK1                 __at(0x7739);	// @ (0xEE7 * 8 + 1)
#define                                 RK1_bit             _BIT_ACCESS(PORTK,1)
// PORTK<RK2>
extern volatile __bit                   RK2                 __at(0x773A);	// @ (0xEE7 * 8 + 2)
#define                                 RK2_bit             _BIT_ACCESS(PORTK,2)
// PORTK<RK3>
extern volatile __bit                   RK3                 __at(0x773B);	// @ (0xEE7 * 8 + 3)
#define                                 RK3_bit             _BIT_ACCESS(PORTK,3)
// PORTK<RK4>
extern volatile __bit                   RK4                 __at(0x773C);	// @ (0xEE7 * 8 + 4)
#define                                 RK4_bit             _BIT_ACCESS(PORTK,4)
// PORTK<RK5>
extern volatile __bit                   RK5                 __at(0x773D);	// @ (0xEE7 * 8 + 5)
#define                                 RK5_bit             _BIT_ACCESS(PORTK,5)
// PORTK<RK6>
extern volatile __bit                   RK6                 __at(0x773E);	// @ (0xEE7 * 8 + 6)
#define                                 RK6_bit             _BIT_ACCESS(PORTK,6)
// PORTK<RK7>
extern volatile __bit                   RK7                 __at(0x773F);	// @ (0xEE7 * 8 + 7)
#define                                 RK7_bit             _BIT_ACCESS(PORTK,7)
// PADCFG1<RKPU>
extern volatile __bit                   RKPU                __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 RKPU_bit            _BIT_ACCESS(PADCFG1,1)
// PORTL<RL0>
extern volatile __bit                   RL0                 __at(0x7720);	// @ (0xEE4 * 8 + 0)
#define                                 RL0_bit             _BIT_ACCESS(PORTL,0)
// PORTL<RL1>
extern volatile __bit                   RL1                 __at(0x7721);	// @ (0xEE4 * 8 + 1)
#define                                 RL1_bit             _BIT_ACCESS(PORTL,1)
// PORTL<RL2>
extern volatile __bit                   RL2                 __at(0x7722);	// @ (0xEE4 * 8 + 2)
#define                                 RL2_bit             _BIT_ACCESS(PORTL,2)
// PORTL<RL3>
extern volatile __bit                   RL3                 __at(0x7723);	// @ (0xEE4 * 8 + 3)
#define                                 RL3_bit             _BIT_ACCESS(PORTL,3)
// PORTL<RL4>
extern volatile __bit                   RL4                 __at(0x7724);	// @ (0xEE4 * 8 + 4)
#define                                 RL4_bit             _BIT_ACCESS(PORTL,4)
// PORTL<RL5>
extern volatile __bit                   RL5                 __at(0x7725);	// @ (0xEE4 * 8 + 5)
#define                                 RL5_bit             _BIT_ACCESS(PORTL,5)
// PORTL<RL6>
extern volatile __bit                   RL6                 __at(0x7726);	// @ (0xEE4 * 8 + 6)
#define                                 RL6_bit             _BIT_ACCESS(PORTL,6)
// PORTL<RL7>
extern volatile __bit                   RL7                 __at(0x7727);	// @ (0xEE4 * 8 + 7)
#define                                 RL7_bit             _BIT_ACCESS(PORTL,7)
// PADCFG1<RLPU>
extern volatile __bit                   RLPU                __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 RLPU_bit            _BIT_ACCESS(PADCFG1,0)
// RPOR0_1<RPO0R0>
extern volatile __bit                   RPO0R0              __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 RPO0R0_bit          _BIT_ACCESS(RPOR0_1,0)
// RPOR0_1<RPO0R1>
extern volatile __bit                   RPO0R1              __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 RPO0R1_bit          _BIT_ACCESS(RPOR0_1,1)
// RPOR0_1<RPO0R2>
extern volatile __bit                   RPO0R2              __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 RPO0R2_bit          _BIT_ACCESS(RPOR0_1,2)
// RPOR0_1<RPO0R3>
extern volatile __bit                   RPO0R3              __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 RPO0R3_bit          _BIT_ACCESS(RPOR0_1,3)
// RPOR10_11<RPO10R0>
extern volatile __bit                   RPO10R0             __at(0x70B8);	// @ (0xE17 * 8 + 0)
#define                                 RPO10R0_bit         _BIT_ACCESS(RPOR10_11,0)
// RPOR10_11<RPO10R1>
extern volatile __bit                   RPO10R1             __at(0x70B9);	// @ (0xE17 * 8 + 1)
#define                                 RPO10R1_bit         _BIT_ACCESS(RPOR10_11,1)
// RPOR10_11<RPO10R2>
extern volatile __bit                   RPO10R2             __at(0x70BA);	// @ (0xE17 * 8 + 2)
#define                                 RPO10R2_bit         _BIT_ACCESS(RPOR10_11,2)
// RPOR10_11<RPO10R3>
extern volatile __bit                   RPO10R3             __at(0x70BB);	// @ (0xE17 * 8 + 3)
#define                                 RPO10R3_bit         _BIT_ACCESS(RPOR10_11,3)
// RPOR10_11<RPO11R0>
extern volatile __bit                   RPO11R0             __at(0x70BC);	// @ (0xE17 * 8 + 4)
#define                                 RPO11R0_bit         _BIT_ACCESS(RPOR10_11,4)
// RPOR10_11<RPO11R1>
extern volatile __bit                   RPO11R1             __at(0x70BD);	// @ (0xE17 * 8 + 5)
#define                                 RPO11R1_bit         _BIT_ACCESS(RPOR10_11,5)
// RPOR10_11<RPO11R2>
extern volatile __bit                   RPO11R2             __at(0x70BE);	// @ (0xE17 * 8 + 6)
#define                                 RPO11R2_bit         _BIT_ACCESS(RPOR10_11,6)
// RPOR10_11<RPO11R3>
extern volatile __bit                   RPO11R3             __at(0x70BF);	// @ (0xE17 * 8 + 7)
#define                                 RPO11R3_bit         _BIT_ACCESS(RPOR10_11,7)
// RPOR12_13<RPO12R0>
extern volatile __bit                   RPO12R0             __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 RPO12R0_bit         _BIT_ACCESS(RPOR12_13,0)
// RPOR12_13<RPO12R1>
extern volatile __bit                   RPO12R1             __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 RPO12R1_bit         _BIT_ACCESS(RPOR12_13,1)
// RPOR12_13<RPO12R2>
extern volatile __bit                   RPO12R2             __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 RPO12R2_bit         _BIT_ACCESS(RPOR12_13,2)
// RPOR12_13<RPO12R3>
extern volatile __bit                   RPO12R3             __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 RPO12R3_bit         _BIT_ACCESS(RPOR12_13,3)
// RPOR12_13<RPO13R0>
extern volatile __bit                   RPO13R0             __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 RPO13R0_bit         _BIT_ACCESS(RPOR12_13,4)
// RPOR12_13<RPO13R1>
extern volatile __bit                   RPO13R1             __at(0x70C5);	// @ (0xE18 * 8 + 5)
#define                                 RPO13R1_bit         _BIT_ACCESS(RPOR12_13,5)
// RPOR12_13<RPO13R2>
extern volatile __bit                   RPO13R2             __at(0x70C6);	// @ (0xE18 * 8 + 6)
#define                                 RPO13R2_bit         _BIT_ACCESS(RPOR12_13,6)
// RPOR12_13<RPO13R3>
extern volatile __bit                   RPO13R3             __at(0x70C7);	// @ (0xE18 * 8 + 7)
#define                                 RPO13R3_bit         _BIT_ACCESS(RPOR12_13,7)
// RPOR14_15<RPO14R0>
extern volatile __bit                   RPO14R0             __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 RPO14R0_bit         _BIT_ACCESS(RPOR14_15,0)
// RPOR14_15<RPO14R1>
extern volatile __bit                   RPO14R1             __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 RPO14R1_bit         _BIT_ACCESS(RPOR14_15,1)
// RPOR14_15<RPO14R2>
extern volatile __bit                   RPO14R2             __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 RPO14R2_bit         _BIT_ACCESS(RPOR14_15,2)
// RPOR14_15<RPO14R3>
extern volatile __bit                   RPO14R3             __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 RPO14R3_bit         _BIT_ACCESS(RPOR14_15,3)
// RPOR14_15<RPO15R0>
extern volatile __bit                   RPO15R0             __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 RPO15R0_bit         _BIT_ACCESS(RPOR14_15,4)
// RPOR14_15<RPO15R1>
extern volatile __bit                   RPO15R1             __at(0x70CD);	// @ (0xE19 * 8 + 5)
#define                                 RPO15R1_bit         _BIT_ACCESS(RPOR14_15,5)
// RPOR14_15<RPO15R2>
extern volatile __bit                   RPO15R2             __at(0x70CE);	// @ (0xE19 * 8 + 6)
#define                                 RPO15R2_bit         _BIT_ACCESS(RPOR14_15,6)
// RPOR14_15<RPO15R3>
extern volatile __bit                   RPO15R3             __at(0x70CF);	// @ (0xE19 * 8 + 7)
#define                                 RPO15R3_bit         _BIT_ACCESS(RPOR14_15,7)
// RPOR16_17<RPO16R0>
extern volatile __bit                   RPO16R0             __at(0x70D0);	// @ (0xE1A * 8 + 0)
#define                                 RPO16R0_bit         _BIT_ACCESS(RPOR16_17,0)
// RPOR16_17<RPO16R1>
extern volatile __bit                   RPO16R1             __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 RPO16R1_bit         _BIT_ACCESS(RPOR16_17,1)
// RPOR16_17<RPO16R2>
extern volatile __bit                   RPO16R2             __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 RPO16R2_bit         _BIT_ACCESS(RPOR16_17,2)
// RPOR16_17<RPO16R3>
extern volatile __bit                   RPO16R3             __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 RPO16R3_bit         _BIT_ACCESS(RPOR16_17,3)
// RPOR16_17<RPO17R0>
extern volatile __bit                   RPO17R0             __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 RPO17R0_bit         _BIT_ACCESS(RPOR16_17,4)
// RPOR16_17<RPO17R1>
extern volatile __bit                   RPO17R1             __at(0x70D5);	// @ (0xE1A * 8 + 5)
#define                                 RPO17R1_bit         _BIT_ACCESS(RPOR16_17,5)
// RPOR16_17<RPO17R2>
extern volatile __bit                   RPO17R2             __at(0x70D6);	// @ (0xE1A * 8 + 6)
#define                                 RPO17R2_bit         _BIT_ACCESS(RPOR16_17,6)
// RPOR16_17<RPO17R3>
extern volatile __bit                   RPO17R3             __at(0x70D7);	// @ (0xE1A * 8 + 7)
#define                                 RPO17R3_bit         _BIT_ACCESS(RPOR16_17,7)
// RPOR18_19<RPO18R0>
extern volatile __bit                   RPO18R0             __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 RPO18R0_bit         _BIT_ACCESS(RPOR18_19,0)
// RPOR18_19<RPO18R1>
extern volatile __bit                   RPO18R1             __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 RPO18R1_bit         _BIT_ACCESS(RPOR18_19,1)
// RPOR18_19<RPO18R2>
extern volatile __bit                   RPO18R2             __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 RPO18R2_bit         _BIT_ACCESS(RPOR18_19,2)
// RPOR18_19<RPO18R3>
extern volatile __bit                   RPO18R3             __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 RPO18R3_bit         _BIT_ACCESS(RPOR18_19,3)
// RPOR18_19<RPO19R0>
extern volatile __bit                   RPO19R0             __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 RPO19R0_bit         _BIT_ACCESS(RPOR18_19,4)
// RPOR18_19<RPO19R1>
extern volatile __bit                   RPO19R1             __at(0x70DD);	// @ (0xE1B * 8 + 5)
#define                                 RPO19R1_bit         _BIT_ACCESS(RPOR18_19,5)
// RPOR18_19<RPO19R2>
extern volatile __bit                   RPO19R2             __at(0x70DE);	// @ (0xE1B * 8 + 6)
#define                                 RPO19R2_bit         _BIT_ACCESS(RPOR18_19,6)
// RPOR18_19<RPO19R3>
extern volatile __bit                   RPO19R3             __at(0x70DF);	// @ (0xE1B * 8 + 7)
#define                                 RPO19R3_bit         _BIT_ACCESS(RPOR18_19,7)
// RPOR0_1<RPO1R0>
extern volatile __bit                   RPO1R0              __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 RPO1R0_bit          _BIT_ACCESS(RPOR0_1,4)
// RPOR0_1<RPO1R1>
extern volatile __bit                   RPO1R1              __at(0x7095);	// @ (0xE12 * 8 + 5)
#define                                 RPO1R1_bit          _BIT_ACCESS(RPOR0_1,5)
// RPOR0_1<RPO1R2>
extern volatile __bit                   RPO1R2              __at(0x7096);	// @ (0xE12 * 8 + 6)
#define                                 RPO1R2_bit          _BIT_ACCESS(RPOR0_1,6)
// RPOR0_1<RPO1R3>
extern volatile __bit                   RPO1R3              __at(0x7097);	// @ (0xE12 * 8 + 7)
#define                                 RPO1R3_bit          _BIT_ACCESS(RPOR0_1,7)
// RPOR20_21<RPO20R0>
extern volatile __bit                   RPO20R0             __at(0x70E0);	// @ (0xE1C * 8 + 0)
#define                                 RPO20R0_bit         _BIT_ACCESS(RPOR20_21,0)
// RPOR20_21<RPO20R1>
extern volatile __bit                   RPO20R1             __at(0x70E1);	// @ (0xE1C * 8 + 1)
#define                                 RPO20R1_bit         _BIT_ACCESS(RPOR20_21,1)
// RPOR20_21<RPO20R2>
extern volatile __bit                   RPO20R2             __at(0x70E2);	// @ (0xE1C * 8 + 2)
#define                                 RPO20R2_bit         _BIT_ACCESS(RPOR20_21,2)
// RPOR20_21<RPO20R3>
extern volatile __bit                   RPO20R3             __at(0x70E3);	// @ (0xE1C * 8 + 3)
#define                                 RPO20R3_bit         _BIT_ACCESS(RPOR20_21,3)
// RPOR20_21<RPO21R0>
extern volatile __bit                   RPO21R0             __at(0x70E4);	// @ (0xE1C * 8 + 4)
#define                                 RPO21R0_bit         _BIT_ACCESS(RPOR20_21,4)
// RPOR20_21<RPO21R1>
extern volatile __bit                   RPO21R1             __at(0x70E5);	// @ (0xE1C * 8 + 5)
#define                                 RPO21R1_bit         _BIT_ACCESS(RPOR20_21,5)
// RPOR20_21<RPO21R2>
extern volatile __bit                   RPO21R2             __at(0x70E6);	// @ (0xE1C * 8 + 6)
#define                                 RPO21R2_bit         _BIT_ACCESS(RPOR20_21,6)
// RPOR20_21<RPO21R3>
extern volatile __bit                   RPO21R3             __at(0x70E7);	// @ (0xE1C * 8 + 7)
#define                                 RPO21R3_bit         _BIT_ACCESS(RPOR20_21,7)
// RPOR22_23<RPO22R0>
extern volatile __bit                   RPO22R0             __at(0x70E8);	// @ (0xE1D * 8 + 0)
#define                                 RPO22R0_bit         _BIT_ACCESS(RPOR22_23,0)
// RPOR22_23<RPO22R1>
extern volatile __bit                   RPO22R1             __at(0x70E9);	// @ (0xE1D * 8 + 1)
#define                                 RPO22R1_bit         _BIT_ACCESS(RPOR22_23,1)
// RPOR22_23<RPO22R2>
extern volatile __bit                   RPO22R2             __at(0x70EA);	// @ (0xE1D * 8 + 2)
#define                                 RPO22R2_bit         _BIT_ACCESS(RPOR22_23,2)
// RPOR22_23<RPO22R3>
extern volatile __bit                   RPO22R3             __at(0x70EB);	// @ (0xE1D * 8 + 3)
#define                                 RPO22R3_bit         _BIT_ACCESS(RPOR22_23,3)
// RPOR22_23<RPO23R0>
extern volatile __bit                   RPO23R0             __at(0x70EC);	// @ (0xE1D * 8 + 4)
#define                                 RPO23R0_bit         _BIT_ACCESS(RPOR22_23,4)
// RPOR22_23<RPO23R1>
extern volatile __bit                   RPO23R1             __at(0x70ED);	// @ (0xE1D * 8 + 5)
#define                                 RPO23R1_bit         _BIT_ACCESS(RPOR22_23,5)
// RPOR22_23<RPO23R2>
extern volatile __bit                   RPO23R2             __at(0x70EE);	// @ (0xE1D * 8 + 6)
#define                                 RPO23R2_bit         _BIT_ACCESS(RPOR22_23,6)
// RPOR22_23<RPO23R3>
extern volatile __bit                   RPO23R3             __at(0x70EF);	// @ (0xE1D * 8 + 7)
#define                                 RPO23R3_bit         _BIT_ACCESS(RPOR22_23,7)
// RPOR24_25<RPO24R0>
extern volatile __bit                   RPO24R0             __at(0x70F0);	// @ (0xE1E * 8 + 0)
#define                                 RPO24R0_bit         _BIT_ACCESS(RPOR24_25,0)
// RPOR24_25<RPO24R1>
extern volatile __bit                   RPO24R1             __at(0x70F1);	// @ (0xE1E * 8 + 1)
#define                                 RPO24R1_bit         _BIT_ACCESS(RPOR24_25,1)
// RPOR24_25<RPO24R2>
extern volatile __bit                   RPO24R2             __at(0x70F2);	// @ (0xE1E * 8 + 2)
#define                                 RPO24R2_bit         _BIT_ACCESS(RPOR24_25,2)
// RPOR24_25<RPO24R3>
extern volatile __bit                   RPO24R3             __at(0x70F3);	// @ (0xE1E * 8 + 3)
